{
  "backend/main.mo": "Defines admin, vehicle, media, blog, and analytics data types and initializes authorization and storage mixins for the backend actor.",
  "feature_evidence.json": "Declares feature evidence linking paginated media fetching to specific frontend hooks and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files and components for reference.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme CSS variables and base styling rules.",
  "frontend/index.html": "HTML entry point setting up root element and loading the main TypeScript bundle.",
  "frontend/REDEPLOYMENT.md": "Provides instructions for rebuilding, deploying, and validating the frontend canister including route checks and media manager tests.",
  "frontend/src/admin/AdminGuard.tsx": "Admin route guard that enforces authentication with an optional emergency bypass for debugging.",
  "frontend/src/admin/AdminLayout.tsx": "Provides the main admin layout with sidebar navigation, active-route detection, and logout handling.",
  "frontend/src/admin/auth/adminSession.ts": "Manages admin session storage with migration from legacy keys, cookie fallback, and token retrieval utilities.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Defines a debug-only emergency bypass that auto-grants Super Admin access when enabled.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access‑denied screen with a prompt to return to the admin login page.",
  "frontend/src/admin/components/AdminPageHeader.tsx": "Renders a simple admin page header with title, optional subtitle, and optional action area.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog for creating and editing blog posts, including media selection and comment management.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with customizable text and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table with search, custom columns, published status display, and edit/delete actions.",
  "frontend/src/admin/components/media/HomeMainBannerManager.tsx": "Manages a list of home page banner images with add, remove, reorder, and picker/upload support.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Displays and filters all media assets with delete functionality, handling images and videos.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Dialog for searching and selecting media assets from the library with preview and error handling.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Button component for uploading image or video files and creating media asset records.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog for adding or editing promotions with fields for content, image selection, and publish state.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog form for creating or editing testimonials with fields for text, rating, image selection, and publish status.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Complex dialog for adding or editing vehicles including basic info, media, variants, technical specs, and commercial feature options.",
  "frontend/src/admin/components/vehicles/CommercialFeaturesEditor.tsx": "Renders checkboxes for commercial vehicle feature flags and updates the features object on toggle.",
  "frontend/src/admin/components/vehicles/TechnicalSpecsEditor.tsx": "Provides form inputs to edit technical spec fields and manage a list of additional features.",
  "frontend/src/admin/components/vehicles/VariantsEditor.tsx": "Manages creation, editing, and deletion of vehicle variants, including their price adjustments and feature lists.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "Defines React Query mutations for CRUD operations on vehicles, promotions, testimonials, and other admin CMS entities using an authenticated actor.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Empty placeholder export kept for backward compatibility.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Handles admin session validation, login flow, and optional emergency bypass session creation.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "UI page for testing admin login by sending credentials to the backend and displaying results.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Login page handling admin authentication, emergency bypass redirect, and form submission.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Admin profile editor that loads user data, updates profile fields, and saves changes through CMS hooks.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Admin interface to list, search, create, edit, and delete blog posts with modal dialogs and CRUD hooks.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Dashboard displaying counts of key CMS resources such as vehicles, promotions, and leads.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Page managing contact and credit simulation leads with search, filtering, and delete actions.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Media management page for uploading assets, configuring homepage banners, and browsing the media library.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Admin page for listing, searching, creating, editing, and deleting promotions with CRUD dialogs and toast feedback.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Admin interface to view, filter, create, edit, and delete testimonials using CRUD components and notifications.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Admin page for managing vehicles with category filtering, search, and full CRUD operations.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays extended visitor statistics in card layout with auto-refreshed metrics and descriptive info.",
  "frontend/src/admin/styles/adminTheme.css": "Defines CSS variables and styles for the admin panel layout, navigation, cards, and themed components.",
  "frontend/src/App.tsx": "Configures all public and admin routes using TanStack Router and wraps pages with their respective layouts.",
  "frontend/src/components/blog/BlogCommentForm.tsx": "A comment form with validation for name, email, and content, supporting replies via parentId and reset behavior.",
  "frontend/src/components/blog/BlogCommentsThread.tsx": "Renders threaded blog comments with reply support, showing nested replies and toggling a reply form.",
  "frontend/src/components/blog/BlogInteractionsBar.tsx": "Displays like, share, and comment buttons with local like tracking and interaction counts.",
  "frontend/src/components/forms/ContactForm.tsx": "A contact submission form that validates required fields, sends data via a mutation hook, and resets on success.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "A credit simulation request form validating key fields and submitting data through a mutation hook.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Global React error boundary that catches render errors and shows a fallback UI with a reload option.",
  "frontend/src/components/home/HomeMainBannerSlider.tsx": "An auto-rotating banner image slider with fallback for single or no images.",
  "frontend/src/components/layout/Footer.tsx": "Renders the footer with contact info, social links, operating hours, and visitor stats.",
  "frontend/src/components/layout/PublicLayout.tsx": "Defines the public page layout with navbar, optional hero, content area, CTA section, footer, and visitor tracking.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Mobile bottom bar offering quick actions (call, WhatsApp, credit form) and a popover menu.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Bottom sheet menu listing navigation links for mobile use.",
  "frontend/src/components/navigation/Navbar.tsx": "Top navigation bar with brand logo, links, WhatsApp button, and a mobile slide-out menu.",
  "frontend/src/components/public/SectionTitle.tsx": "Reusable section title component showing an icon and heading.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Displays a call‑to‑action section prompting users to contact via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Simple hero banner with welcome text and icon.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Vehicle card displaying image, details, price, badges, and actions for detail view or consultation.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including loading identities, login, logout, and tracking login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as vehicles, promotions, blog posts, interactions, and comments.",
  "frontend/src/hooks/useVisitorTracking.ts": "Implements automatic visitor and page‑view tracking with periodic presence updates using mutations from useQueries.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode values, and banner/CTA animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post with likes, shares, comments, and interaction handling using related hooks.",
  "frontend/src/pages/BlogListPage.tsx": "Renders a grid of blog posts with images and links to individual article pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Displays detailed info for a commercial vehicle, including variants, pricing, features, and contact actions.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Lists commercial vehicles grouped by duty class with loading states and category sections.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact form, dealer contact details, location map, and sales consultant info.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring banner sliders, featured vehicles, CTA banner, about section, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Displays detailed info for a passenger vehicle with variant selection, pricing, and contact options.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all published passenger vehicles with a loading state and empty-state handling.",
  "frontend/src/pages/PromoPage.tsx": "Shows promotion cards with images, descriptions, validity dates, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Displays customer testimonials with ratings, images, and basic customer info.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines public and admin route lists for manual smoke testing and provides helpers to generate checklists and validate router configuration.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, storing them in sessionStorage, and managing persisted or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugin usage.",
  "project_state.json": "Describes overall project state, architecture notes, known issues, and version metadata for the automotive web platform."
}