{
  "backend/main.mo": "Main backend actor defining all data types for admin users, vehicles, promotions, testimonials, blogs, media, interactions, and stats, including authorization and storage mixins.",
  "backend/migration.mo": "Migration module containing old and new actor state structures and logic for upgrading stored data across versions.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing UI components, pages, hooks, and admin CMS features.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables, light/dark modes, and base styling.",
  "frontend/index.html": "Entry HTML file loading the root React app with favicon and main script.",
  "frontend/REDEPLOYMENT.md": "Guide explaining how to rebuild, redeploy, and validate the frontend canister including route checks and common issues.",
  "frontend/src/admin/AdminGuard.tsx": "Protects admin routes by enforcing authentication unless emergency bypass is enabled.",
  "frontend/src/admin/AdminLayout.tsx": "Renders the admin dashboard layout with navigation, sidebar, and logout handling.",
  "frontend/src/admin/auth/adminSession.ts": "Manages admin session storage, migration, cookies, token retrieval, and bypass session creation.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Enables or disables a debug-only admin authentication bypass with preset user data.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access denied screen with a redirect button to the admin login page.",
  "frontend/src/admin/components/AdminPageHeader.tsx": "Provides a standardized header component with title, subtitle, and optional actions for admin pages.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog for creating or editing blog posts and managing comments, including image selection and metadata.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for destructive delete actions with optional loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table component with search, column rendering, optional publish status, and edit/delete actions.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Media management panel providing search, preview, and deletion of media assets with error and auth handling.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Media selection dialog that loads, filters, and displays media assets and returns the chosen URL.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Button for uploading media files that converts a file to a data URL and creates a new media asset.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog form for creating or editing promotions with fields for text, dates, image selection, and publish status.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog form for adding or editing testimonials, capturing customer info, review details, rating, image, and publish status.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Complex vehicle form dialog supporting basic info, media, specs, variants, and commercial features with save handling.",
  "frontend/src/admin/components/vehicles/CommercialFeaturesEditor.tsx": "Editor with checkboxes to toggle commercial vehicle feature flags.",
  "frontend/src/admin/components/vehicles/TechnicalSpecsEditor.tsx": "Form for editing technical specifications and managing additional feature list items.",
  "frontend/src/admin/components/vehicles/VariantsEditor.tsx": "UI for adding, editing, and deleting vehicle variants and their features.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "Collection of React Query hooks for fetching and mutating admin CMS data using the actor API.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Deprecated empty module kept only for compatibility.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Manages admin session state, including emergency bypass, session validation, and login handling.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "Provides a debug interface to manually test admin login requests and view token/role results.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Renders the main admin login form with session handling, redirects, and emergency bypass behavior.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Displays and edits the admin user's profile using CMS queries, with form state and save handling.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Manages CRUD operations for blog posts with search, dialogs, and error handling.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Shows summary statistics for CMS entities like vehicles, promotions, testimonials, and blog posts.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Displays and manages contact form submissions and credit simulations with search and delete actions.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Provides UI to upload media and configure homepage banners using a media picker.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Lists, searches, creates, edits, and deletes promotional entries using a CRUD table and form dialog.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Manages customer testimonials with search, create, edit, and delete capabilities.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Admin page for filtering, creating, editing, and deleting vehicles, separated by passenger or commercial category.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays admin visitor statistics using fetched data and renders stat cards and explanatory info.",
  "frontend/src/admin/styles/adminTheme.css": "Defines the admin panel theme, layout, color tokens, and component styling rules.",
  "frontend/src/App.tsx": "Defines the main router configuration for public and admin routes using TanStack Router and layout components.",
  "frontend/src/components/blog/BlogCommentForm.tsx": "Renders a comment form with validation, reset behavior, and support for replying to specific comments.",
  "frontend/src/components/blog/BlogCommentsThread.tsx": "Displays nested blog comments with reply support and renders reply forms inline.",
  "frontend/src/components/blog/BlogInteractionsBar.tsx": "Shows like, share, and comment actions for a blog post, tracking likes via localStorage.",
  "frontend/src/components/forms/ContactForm.tsx": "Form pengiriman kontak dengan validasi dasar yang memanggil API submit contact dan mereset state setelah sukses.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form permintaan simulasi kredit yang mengumpulkan data pengguna dan mengirimnya melalui API sebelum mereset state.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Provides a global React error boundary that shows a fallback UI and reload button on errors.",
  "frontend/src/components/layout/Footer.tsx": "Footer dengan informasi dealer, kontak, media sosial, jam operasional, dan statistik pengunjung.",
  "frontend/src/components/layout/PublicLayout.tsx": "Layout publik yang merender navbar, hero optional, konten utama, CTA bawah, footer, dan bar CTA bawah.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Bar CTA mobile dengan tombol telepon, WhatsApp, kredit, dan menu popover, termasuk form simulasi kredit dalam sheet.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Sheet menu navigasi bawah berisi daftar tautan halaman utama dan ditutup saat item dipilih.",
  "frontend/src/components/navigation/Navbar.tsx": "Navbar responsif dengan menu desktop, sheet mobile, dan tombol WhatsApp.",
  "frontend/src/components/public/SectionTitle.tsx": "Komponen judul section dengan ikon dan teks terpusat.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Section CTA dengan ajakan menghubungi via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner sederhana dengan judul selamat datang dan subjudul.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Card component showing vehicle image, details, price, badges, and links to detail or consultation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity restoration, and auth-client setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating vehicles, blog data, promotions, testimonials, and other backend resources.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors, page views, and periodic presence updates using actor-backed mutations.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining color system, theming, and global typography.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post with likes, shares, comments, and interaction handling.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog posts with images, excerpts, and links to detail pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows detailed info for a commercial vehicle including variants, features, pricing, and contact options.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Displays categorized commercial vehicles (light, medium, tractor head) with filtering and listing.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form, business contact details, map embed, and consultant info.",
  "frontend/src/pages/HomePage.tsx": "Home page showing banners, featured vehicles, about section, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Displays detailed info for a selected passenger vehicle, including variants, pricing, and contact options.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all published non-commercial passenger vehicles using VehicleCard components.",
  "frontend/src/pages/PromoPage.tsx": "Fetches and displays active promotions with images, descriptions, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Shows customer testimonials with ratings, images, and reviews.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines public and admin routes for post-deployment smoke testing and provides validation utilities.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme colors, animations, plugins, and container settings.",
  "project_state.json": "Defines project state, architectural constraints, known issues, and required fixes for an automotive website with stable persistence, backend/frontend separation, and an admin CMS. Includes notes on routing, authentication, media storage, and current bugs affecting frontend rendering and admin login."
}