{
  "backend/main.mo": "Actor defines admin auth, media storage mixins, and data models for vehicles, promotions, testimonials, blog posts, contacts, media assets, and visitor stats.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for admin media manager and CMS save/publish fixes.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components, pages, and admin tools for reference.",
  "frontend/index.css": "Tailwind CSS setup defining base styles, theme variables, and dark mode color tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript module.",
  "frontend/REDEPLOYMENT.md": "Guide describing how to rebuild and redeploy the frontend canister and verify all public and admin routes including media manager authorization.",
  "frontend/src/admin/AdminGuard.tsx": "Component enforcing admin authentication with optional emergency bypass and redirect logic.",
  "frontend/src/admin/AdminLayout.tsx": "Admin layout component with sidebar navigation, active-state logic, and logout handling for admin pages.",
  "frontend/src/admin/auth/adminSession.ts": "Manages admin session storage with localStorage and cookies, including migration from legacy keys and bypass session creation.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Enables or disables a debug-only authentication bypass that auto-creates a Super Admin session.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access denied message with a redirect button to the admin login page.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog for creating or editing blog posts with fields, image picker, and publish options.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with customizable title, description, and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table supporting search, edit/delete actions, and optional published status display.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Displays and filters media assets with delete support and session‑aware error handling.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Modal for selecting a media asset with search, preview grid, and session‑aware loading states.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Upload button that reads a file as a data URL and creates a new media asset with progress feedback.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog for adding or editing promotions with fields, image picker, and publish toggle.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog component for creating or editing testimonials with fields for text, rating, image, and publish state.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Large form dialog for adding or editing vehicles, including basic info, media, variants, specs, and commercial features.",
  "frontend/src/admin/components/vehicles/CommercialFeaturesEditor.tsx": "Editor UI for toggling boolean commercial vehicle feature flags via checkboxes.",
  "frontend/src/admin/components/vehicles/TechnicalSpecsEditor.tsx": "React form component for editing vehicle technical specs and managing additional features.",
  "frontend/src/admin/components/vehicles/VariantsEditor.tsx": "UI for adding, editing, and removing vehicle variants, including features and pricing adjustments.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "React Query hooks for admin CMS operations like managing media assets, contacts, and credit simulations.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Deprecated empty module kept only to avoid breaking imports.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Manages admin session state, validation, login logic, and optional emergency bypass login flow.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "Debug page allowing manual testing of admin login with UI feedback and result display.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Admin login page handling authentication, redirects, form input, and an emergency bypass mode.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Admin profile editor that loads user data, allows updates, and saves changes via API.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Blog management page supporting listing, searching, creating, editing, and deleting blog posts.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Dashboard displaying summary counts of vehicles, promotions, testimonials, blog posts, contacts, and simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Leads manager for viewing, searching, and deleting contact form submissions and credit simulations.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Media manager for uploading and managing assets with session‑error handling.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Promotions management page allowing listing, searching, creating, editing, and deleting promotions.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Admin page for listing, searching, creating, editing, and deleting testimonials using CRUD dialogs and toast notifications.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Admin interface for filtering, managing, and performing CRUD operations on passenger or commercial vehicles.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays visitor statistics with cards and provides a form to update stats via admin API.",
  "frontend/src/App.tsx": "Main routing configuration using TanStack Router for all public and admin pages with layouts and guards.",
  "frontend/src/components/forms/ContactForm.tsx": "Form for submitting contact inquiries, validating required fields, and sending data via mutation.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form for submitting credit simulation requests with validation and mutation handling.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Global React error boundary that catches UI errors and shows a refresh prompt.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact info, social links, and attribution using the current year.",
  "frontend/src/components/layout/PublicLayout.tsx": "Wraps public pages with navbar, optional hero, main content, CTA section, footer, and bottom CTA bar.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Provides a fixed mobile bottom bar with quick actions for calling, WhatsApp, credit simulation, and menu access.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Displays a slide-up sheet containing navigation links for mobile menus.",
  "frontend/src/components/navigation/Navbar.tsx": "Implements a responsive navigation bar with links, WhatsApp contact button, and mobile slide-out menu.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Shows a promotional call-to-action section encouraging users to contact via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays a simple hero banner with a title and tagline.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Renders a vehicle card with image, pricing, features, navigation to details, and WhatsApp consultation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating vehicle, blog, promotion, contact, and interaction data through the actor API.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors and page views by triggering mutations once per session.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/BlogDetailPage.tsx": "Loads and displays a single blog post with metadata updates and fallback states.",
  "frontend/src/pages/BlogListPage.tsx": "Fetches and lists all blog posts with preview cards and loading state.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Displays detailed vehicle info with likes, shares, images, and categorized features.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Fetches vehicles, filters commercial types, and renders categorized vehicle sections.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form along with contact info, map embed, and consultant details.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with banner carousel, featured vehicles, blog posts, and a vehicle search filter.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Displays detailed passenger vehicle info with images, variants, pricing, likes, and share actions.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all published passenger vehicles with loading and empty states.",
  "frontend/src/pages/PromoPage.tsx": "Fetches and displays current promotions with images, descriptions, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Shows customer testimonials with ratings, images, and reviewer details.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines public and admin routes for smoke testing and utilities to generate checklists and validate route configs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, theme extensions (colors, radius, shadows), custom animations, and plugins.",
  "project_state.json": "Project state metadata describing architecture, constraints, known issues, and current backend/frontend requirements for an automotive website."
}