{
  "backend/main.mo": "Defines the main Motoko canister with storage mixins, admin auth structures, vehicle CMS types, and initial maps for data storage.",
  "backend/migration.mo": "Provides a no-op migration function that returns the received state unchanged.",
  "feature_evidence.json": "Empty feature evidence report JSON structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files including pages, components, and admin tools.",
  "frontend/index.css": "Tailwind CSS base setup defining color variables, dark mode overrides, and global styles.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/src/admin/AdminGuard.tsx": "Protects admin routes by validating session state and redirecting unauthenticated users to login.",
  "frontend/src/admin/AdminLayout.tsx": "Admin dashboard layout with sidebar navigation, logout handling, and content area.",
  "frontend/src/admin/auth/adminSession.ts": "LocalStorage and cookie utilities for reading, writing, and clearing admin session tokens and roles.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access denied message with a button to return to the login page.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog form for creating or editing blog posts with fields for metadata, content, and image selection.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with customizable title, description, and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table component supporting search, custom columns, published status, and edit/delete actions.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Displays media assets with search, previews, and delete functionality using admin queries.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Dialog for selecting media assets with search, preview grid, and selection handling.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Provides a button to upload media files by converting them to data URLs and sending them to the backend.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog form for adding or editing promotions with fields for description, terms, dates, image, and publish toggle.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog form for creating or editing customer testimonials, including rating, review text, image, and publish toggle.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Dialog form for managing vehicle entries with fields for specs, media, pricing, variants, and commercial options.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "Defines React Query hooks for fetching and mutating CMS data including media, contacts, and credit simulations.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Mutation hook to test admin login debugging and return detailed login reports.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Manages admin session state, validation, login, and logout using stored tokens and actor calls.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "UI page for testing admin login with form inputs, result display, and direct actor login calls.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Admin login form handling authentication, redirects, and validation UI states.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Profile editor that loads, displays, and saves admin user profile data.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "CRUD interface for blog posts with search, edit, create, and delete dialogs.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Dashboard showing summary counts of vehicles, promotions, testimonials, blogs, contacts, and simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Manages contact and credit simulation leads with search and deletion workflows.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Media management page with upload button, error handling, and asset panel display.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "CRUD page for promotions with search, create, edit, and delete capabilities.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Admin page for listing, searching, creating, editing, and deleting testimonials using CRUD dialogs and table components.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Admin interface to manage vehicles with category filtering, search, and CRUD operations through a table and form dialog.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays visitor statistics and provides a form for updating numeric site metrics.",
  "frontend/src/App.tsx": "Sets up all public and admin routes using TanStack Router with layout wrappers and guards.",
  "frontend/src/components/forms/ContactForm.tsx": "Form for submitting contact inquiries, validating required fields and sending data via mutation.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form for submitting credit simulation requests with validation and mutation handling.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that displays a fallback UI and reload option when an unhandled error occurs.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact info, social links, branding, and a dynamic copyright.",
  "frontend/src/components/layout/PublicLayout.tsx": "Defines the public page layout with navbar, optional hero, content area, CTA section, footer, and tracking.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Provides a mobile bottom bar with call, WhatsApp, credit simulation, and menu actions using sheets.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Implements a slide-up menu listing navigation links for mobile access.",
  "frontend/src/components/navigation/Navbar.tsx": "Creates a responsive top navigation bar with links, logo, WhatsApp contact button, and mobile drawer menu.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Displays a CTA section encouraging users to contact via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a simple hero banner with a title and subtitle.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Renders a vehicle card with image, details, feature badges, WhatsApp consult link, and detail navigation.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of authenticated or anonymous backend actors and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, state, and provider setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating vehicle, blog, promotion, and interaction data via an actor instance.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors and page views using mutation hooks and sessionStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post with SEO updates and handles loading and not-found states.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog posts with basic previews and loading handling.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows commercial vehicle details with like/share actions and interaction counts.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Displays categorized commercial vehicles filtered into light, medium, and tractor groups.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form along with contact details, map, and consultant info.",
  "frontend/src/pages/HomePage.tsx": "Home page with banners, featured vehicles, search, about section, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Shows detailed info for a selected passenger vehicle, including variants, pricing, likes, and sharing actions.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Fetches and displays a grid of non-commercial passenger vehicles with loading and empty states.",
  "frontend/src/pages/PromoPage.tsx": "Lists current promotions with images, descriptions, validity dates, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Displays customer testimonials with ratings, images, and reviewer details.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing architecture, issues, and requirements for a stable automotive site with admin CMS."
}