{
  "backend/main.mo": "Defines the canister's data models and storage maps for vehicles, promotions, testimonials, blog posts, contacts, media, interactions, and includes admin authorization and blob storage mixins.",
  "feature_evidence.json": "Lists feature evidence mapping features to related source files, components, and test IDs for build verification.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of several frontend page and component files.",
  "frontend/index.css": "Tailwind CSS configuration defining global theme variables and light/dark mode styles.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx.",
  "frontend/src/admin/AdminGuard.tsx": "Protects admin routes by verifying Internet Identity login and admin permissions before rendering children.",
  "frontend/src/admin/AdminLayout.tsx": "Provides the admin panel layout with a sidebar navigation menu and logout handling.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Internet Identity–based admin login page that redirects authenticated admins to the dashboard.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Allows admins to view and update their profile data via form fields with save functionality.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Displays blog post count and placeholder for CRUD with a button to add posts.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Fetches multiple datasets and shows a grid of statistical summary cards.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Shows contact and credit simulation lead counts in tabbed sections with placeholders.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Shows media asset count with a button to upload and placeholder for gallery.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Displays promotion count and an add button with placeholder CRUD area.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Shows testimonial count with button to add and placeholder CRUD interface.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Displays vehicle count with add button and placeholder for CRUD features.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Fetches and displays visitor statistics in a grid layout.",
  "frontend/src/App.tsx": "Sets up all public and admin routes using TanStack Router and wraps pages with appropriate layouts and guards.",
  "frontend/src/components/forms/ContactForm.tsx": "Handles contact form submission, validation, and sending contact data via mutation.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Manages credit simulation form submission with validation and mutation to backend.",
  "frontend/src/components/layout/Footer.tsx": "Renders footer with contact info, social links, and live visitor stats.",
  "frontend/src/components/layout/PublicLayout.tsx": "Defines public site layout with navbar, hero, footer, CTA sections, and visitor tracking.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Mobile bottom CTA bar offering call, WhatsApp, credit form, and menu sheet access.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Bottom sheet mobile menu listing navigation links and closing on selection.",
  "frontend/src/components/navigation/Navbar.tsx": "Responsive navbar with logo, nav links, WhatsApp button, and mobile slide-out menu.",
  "frontend/src/components/sections/BottomCTASection.tsx": "CTA section prompting users to contact via WhatsApp with styled button.",
  "frontend/src/components/sections/HeroSection.tsx": "Simple hero banner with title and subtitle on a red background.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Displays vehicle image, details, price, feature badges, and consult/detail actions.",
  "frontend/src/hooks/useActor.ts": "Manages creation and refreshing of backend actor based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data like vehicles and promotions.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors and page views using mutation hooks and session storage.",
  "frontend/src/index.css": "Tailwind setup with extensive CSS variables and theming for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post with SEO updates, loading states, and full post content.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog posts with images and previews, linking to individual post pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows detailed info for a commercial vehicle with pricing, features, likes, and share options.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Displays commercial vehicles grouped into Light Duty, Medium Duty, and Tractor Head categories.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form along with contact info, map location, and sales consultant details.",
  "frontend/src/pages/HomePage.tsx": "Homepage with banners, featured vehicles, search, about section, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Shows detailed info for a passenger vehicle with variants, pricing, likes, and share features.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all passenger vehicles in a grid layout.",
  "frontend/src/pages/PromoPage.tsx": "Displays current promotions with images, descriptions, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders a testimonials grid fetched via useGetTestimonials, showing loading state, star ratings, and fallback images.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading/storing URL parameters and session-backed persistence with hash/query support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins.",
  "project_state.json": "Project state metadata describing architecture, features, image requirements, and known issues."
}