{
  "backend/main.mo": "Actor defining admin auth, user profiles, vehicles, promotions, media assets, interactions, and visitor stats with mixin-based storage and authorization.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing multiple frontend components, pages, and admin tools for reference.",
  "frontend/index.css": "Tailwind CSS base configuration defining light/dark theme variables and global styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/REDEPLOYMENT.md": "Guide for redeploying the frontend canister and manually validating all routes post-deployment.",
  "frontend/src/admin/AdminGuard.tsx": "Admin route guard handling authentication and a temporary emergency bypass mode for debug access.",
  "frontend/src/admin/AdminLayout.tsx": "Provides the admin dashboard layout with navigation, active-link highlighting, and logout handling.",
  "frontend/src/admin/auth/adminSession.ts": "Manages admin session storage with localStorage and cookies, including migration from legacy keys and token retrieval.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Enables an emergency debug bypass that auto-creates a Super Admin session and skips authentication.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access denied screen with a redirect button to the admin login page.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "A dialog for creating or editing blog posts with controlled form fields and image selection.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "A reusable confirmation dialog for delete actions with customizable text and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table component with search, edit/delete actions, and optional published status badges.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Media browser with search, preview, and delete functionality backed by admin CMS queries.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Modal to search and select a media asset, returning its URL to the caller.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Upload button that converts files to data URLs and creates media assets through CMS APIs.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog for creating or editing promotions with form inputs, image selection, and publish toggle.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog form for creating or editing testimonials with fields for text, rating, image, and publish state.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Dialog form for adding or editing vehicles, handling specs, media fields, commercial flags, and variant data.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "React Query hooks for CRUD operations on media assets, contacts, credit simulations, and visitor data using the admin actor.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Deprecated empty module kept for compatibility with old imports.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Manages admin session state with validation, login, logout, and optional emergency bypass mode.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "Provides a debug interface to test admin login calls and display raw results.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Renders the admin login form, handles authentication, redirects, and emergency bypass behavior.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Displays and edits the admin user's profile, loading existing data and saving updates.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Implements blog management with list, search, create, edit, and delete operations using CMS APIs.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Shows high‑level CMS statistics for vehicles, promotions, testimonials, blog posts, contacts, and simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Manages contact form leads and credit simulation requests with search, filtering, and delete functionality. Uses tabs to switch between contacts and simulations and displays confirmation dialogs for deletions.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Displays a media management interface with upload support and error alerts. Loads media assets and renders the media manager panel.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Provides CRUD management for promotions with search, edit, delete, and form dialogs. Integrates table rendering and mutation hooks for backend operations.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Enables CRUD operations for testimonials with search, edit, delete, and form dialogs. Renders testimonials in a table with rating and review previews.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Handles vehicle management with category filtering, search, and CRUD actions. Uses a table view and form dialogs to create or edit vehicles.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays visitor statistics in metric cards and provides a form to update stats. Fetches current stats and supports saving edited values via mutation.",
  "frontend/src/App.tsx": "Root router configuration defining all public and admin routes with layouts and components.",
  "frontend/src/components/forms/ContactForm.tsx": "Form component for submitting contact inquiries, validating required fields and sending data via useAddContact.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form for submitting credit simulation requests with validation and submission through useAddCreditSimulation.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Implements a global React error boundary that logs errors and shows a fallback UI with a refresh button. Catches rendering errors and prevents app crashes.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying dealer info, social links, and a branded copyright section.",
  "frontend/src/components/layout/PublicLayout.tsx": "Public-facing page layout including navbar, optional hero section, content area, CTA section, and footer.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Mobile bottom bar offering quick actions for calling, WhatsApp, credit simulation, and opening the main menu.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Slide-up sheet showing navigation links for mobile menu access.",
  "frontend/src/components/navigation/Navbar.tsx": "Top navigation bar with links, WhatsApp contact button, and mobile slide-out menu.",
  "frontend/src/components/sections/BottomCTASection.tsx": "CTA section prompting users to contact the dealer via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Simple hero section with a title and tagline.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Card displaying vehicle info, pricing, features, and actions for consulting or viewing details.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating backend data such as vehicles, promotions, blog posts, and interactions.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors and page views using mutations and sessionStorage.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and custom design tokens for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, and Internet Identity provider configuration.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post, updates SEO metadata, and handles loading or missing content states.",
  "frontend/src/pages/BlogListPage.tsx": "Lists blog posts with previews and links to detail pages, showing a message when none exist.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows detailed vehicle info with interactions like liking and sharing, including UI controls and stats.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Displays categorized commercial vehicle listings filtered into light duty, medium duty, and tractor head groups.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with a form, contact details, a map iframe, and a sales consultant profile.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage with banner carousel, featured vehicles, search, about section, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Shows detailed info for a passenger vehicle including variants, pricing, like/share actions, and consultation link.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all passenger vehicles with loading state and empty-state handling.",
  "frontend/src/pages/PromoPage.tsx": "Displays current promotions with images, descriptions, validity, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders customer testimonials with ratings, images, and reviews.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines public/admin routes and utilities for smoke testing and route validation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color system, extended theme values, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, architecture requirements, known issues, and existing features for an automotive website with stable backend persistence and an admin CMS."
}