{
  "backend/main.mo": "Defines actor with admin auth, storage maps, and typed models for vehicles, promotions, blog posts, leads, media, and stats using mixins for auth and blob storage.",
  "feature_evidence.json": "Lists feature evidence for admin auth overhaul and session‑token guarding with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten 1–2 sentence summaries of numerous frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base/theme file defining CSS variables for light and dark modes plus global styling.",
  "frontend/index.html": "Root HTML file mounting the SPA and loading the main TypeScript entrypoint.",
  "frontend/src/admin/AdminGuard.tsx": "Protects admin routes using session-token validation and redirects unauthenticated users to the login page.",
  "frontend/src/admin/AdminLayout.tsx": "Provides admin dashboard layout with sidebar navigation and logout handling via session-token auth.",
  "frontend/src/admin/auth/adminSession.ts": "Implements admin session persistence using localStorage and cookies with helpers for getting, setting, and clearing tokens.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access denied message with a button redirecting users to the admin login page.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog for creating or editing blog posts with fields for content, metadata, and image selection.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with optional loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table component with search, status display, and edit/delete action buttons.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Displays, searches, and deletes media assets with preview thumbnails and a confirmation dialog.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Provides a searchable dialog to browse and select a media asset by URL.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Handles file selection and uploads media as a data URL, triggering a mutation and optional callback.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog for adding or editing promotions with fields for details, validity date, and image selection.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog for creating or editing testimonials including customer info, review, rating, and image.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Dialog for managing vehicle entries with fields for specs, media, pricing, and commercial options.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "Defines React Query hooks for CRUD operations on media, contacts, credit simulations, and visitor stats via an admin actor.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Manages admin session validation, login, and logout using actor API calls and stored session tokens.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Renders the admin login form, performs authentication, and redirects authenticated users.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Loads, edits, and saves the admin user's profile using query hooks and form state.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Blog management page with CRUD operations, search filtering, and dialogs for editing, creating, and deleting blog posts.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Dashboard displaying summary statistics for vehicles, promotions, testimonials, blog posts, contacts, and credit simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Admin interface for viewing, searching, and deleting contact form submissions and credit simulations with tabbed navigation.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Media management page showing upload controls, error alerts, and a panel listing media assets.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Promotions management page supporting CRUD operations, search filtering, and dialogs for creating, editing, and deleting promotions.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Testimonials admin page providing CRUD functionality with search filtering and dialogs for editing and deleting testimonials.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Vehicle management page with category-based filtering, search, and dialogs for creating, editing, and deleting vehicles.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Admin page that displays visitor statistics and provides a form to update BigInt-based stats via CMS hooks.",
  "frontend/src/App.tsx": "Configures all public and admin routes with TanStack Router, wrapping admin routes in AdminGuard and layouts.",
  "frontend/src/components/forms/ContactForm.tsx": "Form for submitting contact inquiries, validating required fields, and sending data through a mutation hook.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form for submitting credit simulation requests with required fields and mutation handling.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that catches global UI errors and shows a fallback screen with a reload button.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing dealer info, contact details, social links, and attribution.",
  "frontend/src/components/layout/PublicLayout.tsx": "Public page layout including navbar, optional hero, footer, CTA sections, and visitor tracking.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Mobile bottom bar with call, WhatsApp, credit simulation, and menu actions using sheets.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Slide-up sheet showing navigation links and closing on selection.",
  "frontend/src/components/navigation/Navbar.tsx": "Responsive navbar with links, logo, WhatsApp button, and mobile sheet menu.",
  "frontend/src/components/sections/BottomCTASection.tsx": "CTA section with headline and WhatsApp contact button.",
  "frontend/src/components/sections/HeroSection.tsx": "Simple hero banner with title and subtitle.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Displays vehicle details, features, pricing, and provides consult and detail buttons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating vehicles, promotions, blog posts, interactions, and more.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors and page views using mutations and sessionStorage.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for theming in light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and Internet Identity provider.",
  "frontend/src/pages/BlogDetailPage.tsx": "Fetches and renders a single blog post with SEO updates and fallback states.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a grid of blog posts fetched from the API with loading and empty states.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows detailed info for a commercial vehicle with like/share actions and feature badges.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Lists commercial vehicles categorized into light duty, medium duty, and tractor head groups.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form and static contact details including location and consultant info.",
  "frontend/src/pages/HomePage.tsx": "Home page with banners, featured vehicles, search, about section, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Displays details for a passenger vehicle with variant selection, pricing, and like/share actions.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all passenger vehicles with loading and empty states.",
  "frontend/src/pages/PromoPage.tsx": "Shows current promotions with images, descriptions, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Displays customer testimonials with ratings, photos, and reviews.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters (including hash routing), persist them in sessionStorage, and clear stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project's architecture, features, known issues, and migration-safety requirements for an auto company website with CMS and admin systems."
}