{
  "backend/main.mo": "Main backend actor defining admin auth, vehicle CMS types, visitor tracking fields, and storage/authorization mixins.",
  "backend/migration.mo": "Migration module converting old actor state to the new structure with expanded visitor stats and onlineSessions map.",
  "feature_evidence.json": "Feature evidence report listing required frontend files, feature IDs, and components for visitor stats updates and polling behavior.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend pages, components, and admin CMS utilities.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables, themes, and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app root and main script with favicon and metadata.",
  "frontend/REDEPLOYMENT.md": "Guide explaining how to rebuild, redeploy, and manually validate all frontend routes and admin media functionality.",
  "frontend/src/admin/AdminGuard.tsx": "Protects admin routes by checking session state and optionally bypassing auth for debugging.",
  "frontend/src/admin/AdminLayout.tsx": "Provides the admin dashboard layout with navigation, logout handling, and active nav highlighting.",
  "frontend/src/admin/auth/adminSession.ts": "Manages admin session storage, migration, cookies, and includes helpers for bypass sessions.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Enables a temporary authentication bypass and defines static bypass session info.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access denied message with a link back to the admin login page.",
  "frontend/src/admin/components/AdminPageHeader.tsx": "Renders a reusable admin page header with title, optional subtitle, and optional action area.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog for creating or editing blog posts, including image selection, comment management, and form state handling.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with customizable text and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table component with optional search, published status column, and edit/delete actions.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Media management panel with search, listing, deletion, and error handling for media assets.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Dialog component to browse, search, and select media assets with loading and error states.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Upload button that reads a selected file as data URL and creates a media asset via mutation.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog form for creating or editing promotions with fields for text, dates, image selection, and publish status.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog form for creating or editing testimonials including customer info, review fields, rating, image selection, and publish toggle.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Complex vehicle creation/edit dialog supporting basic details, media, pricing, specs, variants, and commercial feature fields.",
  "frontend/src/admin/components/vehicles/CommercialFeaturesEditor.tsx": "Checkbox editor for toggling boolean commercial vehicle feature flags.",
  "frontend/src/admin/components/vehicles/TechnicalSpecsEditor.tsx": "Form editor for technical specs with fields and dynamic additional features list management.",
  "frontend/src/admin/components/vehicles/VariantsEditor.tsx": "Editor for adding, editing, and deleting vehicle variants with feature lists and premium flag.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "React Query hooks wrapping admin CMS CRUD operations requiring a session token.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Empty placeholder export kept for compatibility; no functional code.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Hook managing admin authentication, validating stored sessions, handling emergency bypass, and providing login logic.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "Debug interface that tests admin login by calling adminLogin and displaying raw results.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Admin login form handling authentication via useAdminSession, with emergency bypass redirect logic.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Page for viewing and editing the admin user's profile using fetch and save profile hooks.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "CMS page for listing, searching, creating, editing, and deleting blog posts with CRUD dialogs.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Dashboard showing counts of vehicles, promotions, testimonials, blogs, contacts, and credit simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Displays and manages contacts and credit simulations with search, deletion, and error handling.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Shows media assets, upload controls, and an auth-error alert if the session is invalid.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Lists, searches, creates, edits, and deletes promotions using a CRUD table and form dialog.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Provides CRUD management for testimonials with search, edit, and delete workflows.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Manages vehicles with category filtering, search, and CRUD operations via a table and form.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays real-time visitor statistics in cards with loading and error states.",
  "frontend/src/admin/styles/adminTheme.css": "Defines admin-specific CSS variables and styles for layout, navigation, tables, cards, and buttons.",
  "frontend/src/App.tsx": "Defines the full public and admin routing structure using TanStack Router, wiring layouts and pages for each route.",
  "frontend/src/components/blog/BlogCommentForm.tsx": "Form component for creating or replying to blog comments with validation and reset handling.",
  "frontend/src/components/blog/BlogCommentsThread.tsx": "Renders nested blog comments with reply support and conditional reply forms.",
  "frontend/src/components/blog/BlogInteractionsBar.tsx": "Displays like, share, and comment actions for a blog post with local like tracking and tooltips.",
  "frontend/src/components/forms/ContactForm.tsx": "Contact form that collects user details, validates required fields, submits data, and resets on success.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form for submitting credit simulation requests with validation, API mutation, and reset on success.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a fallback UI with a refresh button.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing dealer info, contact details, social media links, and visitor stats.",
  "frontend/src/components/layout/PublicLayout.tsx": "Public page layout combining navbar, hero, main content, CTA sections, and footer with visitor tracking.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Mobile bottom bar offering call, WhatsApp, credit simulation, and navigation menu popover.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Bottom sheet navigation menu listing main site routes for mobile.",
  "frontend/src/components/navigation/Navbar.tsx": "Top navigation bar with responsive menu, route links, and WhatsApp contact button.",
  "frontend/src/components/public/SectionTitle.tsx": "Utility component rendering a section title with an icon.",
  "frontend/src/components/sections/BottomCTASection.tsx": "CTA section encouraging users to contact via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Simple hero banner welcoming users with title and subtitle.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Card displaying vehicle image, details, price, features, and actions for detail view or consultation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, reinitializing it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for Internet Identity authentication, managing login, logout, and identity loading via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as vehicles, promotions, blog posts, interactions, and contacts.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors and page views using sessionStorage and mutation hooks.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and global styles.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post, tracking views and enabling likes, shares, and comments with reactive updates.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog posts with images and summaries, linking to individual blog detail pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows detailed information for a commercial vehicle with liking, sharing, and interaction tracking.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Lists commercial vehicles, groups them by type, and displays them with loading and empty states.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form and detailed contact info including map, consultant details, and business hours.",
  "frontend/src/pages/HomePage.tsx": "Shows featured vehicles, a CTA banner, about section, vehicle search, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Displays detailed info for a passenger vehicle with variants, price, liking, and sharing actions.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all published passenger vehicles with loading and empty states.",
  "frontend/src/pages/PromoPage.tsx": "Displays current promotions with images, descriptions, valid dates, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders customer testimonials with ratings, images, and reviews.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines public and admin routes for smoke testing and utilities for checklist generation and route validation.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and removing them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, containers, and plugin setup.",
  "project_state.json": "Project metadata describing architecture, constraints, known issues, and existing features for the automotive website system."
}