{
  "backend/main.mo": "Main actor defining admin auth, media storage mixins, and data types for vehicles, promotions, testimonials, blogs, contacts, and stats.",
  "backend/migration.mo": "Migration module converting old media assets to new format with legacyDataUrl and externalBlob fields.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend components and pages.",
  "frontend/index.css": "Tailwind CSS config defining color variables and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app and setting page metadata.",
  "frontend/REDEPLOYMENT.md": "Guide describing steps to rebuild, redeploy, and validate frontend canister routes and media manager authorization.",
  "frontend/src/admin/AdminGuard.tsx": "Admin guard component enforcing admin authentication with optional emergency bypass mode.",
  "frontend/src/admin/AdminLayout.tsx": "Admin layout component with collapsible sidebar, navigation links, and logout handling.",
  "frontend/src/admin/auth/adminSession.ts": "Manages admin session storage with localStorage and cookies, including legacy migration and bypass support.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Enables a temporary admin authentication bypass with predefined Super Admin data.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access denied message with a button redirecting to the admin login page.",
  "frontend/src/admin/components/AdminPageHeader.tsx": "Renders a page header with title, optional subtitle, and optional action area.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog for creating and editing blog posts, including image selection and comment management.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with customizable text and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table with search, custom column renderers, status badges, and edit/delete actions.",
  "frontend/src/admin/components/media/HomeMainBannerManager.tsx": "Manages homepage slider banner images with add, remove, reorder, and library selection features.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Media library panel allowing search, preview, and deletion of uploaded media assets.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Dialog for browsing and selecting media assets with search, filtering, and error handling.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Button component for uploading media files, converting them to data URLs, and creating media records.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog for creating and editing promotions with fields for details, dates, images, and publish state.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Form dialog for creating or editing testimonials with fields for text, rating, image selection, and publish status.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Comprehensive vehicle editor dialog supporting basic info, media, variants, technical specs, commercial features, and publish controls.",
  "frontend/src/admin/components/vehicles/CommercialFeaturesEditor.tsx": "UI component rendering checkboxes for commercial vehicle feature toggles and updating parent state.",
  "frontend/src/admin/components/vehicles/TechnicalSpecsEditor.tsx": "Form component for editing technical spec fields and managing a list of additional features.",
  "frontend/src/admin/components/vehicles/VariantsEditor.tsx": "Manages creation, editing, and deletion of vehicle variants with features and pricing adjustments.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "Collection of React Query hooks for CRUD operations on CMS entities using authenticated admin actor calls.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Deprecated placeholder export kept only to avoid breaking imports.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Hook managing admin session state, validation, login, and emergency bypass logic.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "Debug page to test admin login via UI, displaying results and error states.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Admin login form that handles authentication, redirects on success, and includes an emergency bypass mode and validation states.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Admin profile editing page that loads the user profile, allows updates, and saves changes via CMS API hooks.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Blog management interface providing CRUD operations, search filtering, and dialogs for creating, editing, and deleting posts.",
  "frontend/src/admin/pages/DashboardPage.tsx": "CMS dashboard showing summary counts of vehicles, promotions, testimonials, blog posts, contacts, and credit simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Management page for contact form submissions and credit simulations with search, tabbed views, and delete actions.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Media management page enabling upload, deletion, and selection of media assets, including banner configuration and library browsing.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Admin page that lists, searches, creates, edits, and deletes promotions using dialogs and CRUD hooks.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Admin interface for viewing, filtering, adding, editing, and deleting testimonials through CRUD operations.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Admin page for managing vehicles with category filtering, search, and full CRUD form and delete workflows.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays extended visitor statistics in card format with loading/error states and auto-refresh behavior.",
  "frontend/src/admin/styles/adminTheme.css": "CSS theme defining layout, sidebar, cards, tables, and button styles for the admin UI.",
  "frontend/src/App.tsx": "Root routing configuration for all public and admin pages using TanStack Router and shared layouts.",
  "frontend/src/components/blog/BlogCommentForm.tsx": "Comment form component with validation, reset behavior, and support for reply mode.",
  "frontend/src/components/blog/BlogCommentsThread.tsx": "Renders nested blog comments with reply handling and dynamic reply forms.",
  "frontend/src/components/blog/BlogInteractionsBar.tsx": "Displays like, share, and comment actions with local like tracking and tooltips.",
  "frontend/src/components/forms/ContactForm.tsx": "Contact form that validates required fields, submits via mutation hook, and resets on success.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form for submitting credit simulation requests with validation and mutation handling.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that captures uncaught errors and shows a refresh prompt fallback UI.",
  "frontend/src/components/home/HomeMainBannerSlider.tsx": "Auto-rotating banner slider with animation control and fallbacks for single or no images.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact info, social links, and visitor stats.",
  "frontend/src/components/layout/PublicLayout.tsx": "Wraps public pages with navbar, optional hero, CTA sections, and footer.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Provides a mobile bottom action bar with call, WhatsApp, credit simulation, and menu options.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Displays a bottom sheet navigation menu listing main site routes.",
  "frontend/src/components/navigation/Navbar.tsx": "Renders the top navigation bar with links, WhatsApp button, and mobile menu drawer.",
  "frontend/src/components/public/SectionTitle.tsx": "Reusable section title component with icon and styled heading.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Call‑to‑action section prompting users to contact via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a branded hero header with welcome text and tagline.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Displays a vehicle's image, details, price, features, and links to detail or consultation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity login, state management, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as vehicles, blogs, promotions, and interactions.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors, page views, and periodic presence updates using mutations tied to actor availability.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables, themes, and animations for banners and layout adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/BlogDetailPage.tsx": "Renders a blog article page with likes, shares, comments, and related data fetched via hooks.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a grid of blog posts with loading state and links to individual blog detail pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Displays detailed info for a selected commercial vehicle, including variants, pricing, features, and contact actions.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Lists all published commercial vehicles and groups them into light-duty, medium-duty, and tractor head categories.",
  "frontend/src/pages/ContactPage.tsx": "Shows a contact form along with dealer contact details, map location, and sales consultant information.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring banner sliders, highlighted vehicles, about section, CTA banner, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Displays detailed info for a selected passenger vehicle with variants, pricing, and contact options.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all published passenger vehicles in a grid with loading and empty states.",
  "frontend/src/pages/PromoPage.tsx": "Shows active promotions with images, descriptions, validity dates, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Displays customer testimonials with ratings, photos, and reviews.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines route definitions and lists of public/admin routes for manual smoke testing, plus utilities to generate checklists and validate router path coverage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, storing them in sessionStorage, and managing persisted or cleared parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, architecture rules, known issues, and constraints for the automotive site’s backend/frontend and admin CMS."
}