{
  "backend/main.mo": "Defines data models and initializes authorization and storage mixins for admin users, vehicles, blog posts, interactions, comments, and related CMS entities.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides concise summaries for various frontend components, pages, and admin modules.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and styling for light and dark modes.",
  "frontend/index.html": "Root HTML file loading the frontend app with favicon and title metadata.",
  "frontend/REDEPLOYMENT.md": "Documentation describing how to redeploy the frontend canister and validate routes and media manager functionality.",
  "frontend/src/admin/AdminGuard.tsx": "Wrapper that enforces admin authentication, with a debug bypass mode and redirects unauthenticated users.",
  "frontend/src/admin/AdminLayout.tsx": "Admin dashboard layout providing navigation, sidebar, and logout handling.",
  "frontend/src/admin/auth/adminSession.ts": "Utilities for storing, retrieving, migrating, and clearing admin session tokens and roles.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Debug config enabling authentication bypass and auto‑created super admin sessions.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Simple view informing users they lack admin permissions with a button to return to login.",
  "frontend/src/admin/components/AdminPageHeader.tsx": "Reusable header component for admin pages with title, subtitle, and optional actions.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog for creating or editing blog posts, including metadata, image selection, and comment moderation.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with customizable text and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table with search, custom columns, edit/delete actions, and optional published status.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Media management panel allowing search, preview, and deletion of uploaded media assets with error handling.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Dialog for browsing and selecting media assets with search, preview, and auth-aware error states.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Button component that uploads media files by converting them to data URLs and sending them to the backend.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog form for creating or editing a promotion with fields for text data, image selection, and publish toggle.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog form for adding or editing customer testimonials, including name, city, review, rating, image, and publish status.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Large dialog for creating or editing vehicles with tabs for basic info, media, variants, specs, and optional commercial features.",
  "frontend/src/admin/components/vehicles/CommercialFeaturesEditor.tsx": "Renders checkboxes for commercial vehicle feature toggles and updates the parent state when a feature is toggled.",
  "frontend/src/admin/components/vehicles/TechnicalSpecsEditor.tsx": "Provides input fields for technical specs and allows adding or removing additional feature strings.",
  "frontend/src/admin/components/vehicles/VariantsEditor.tsx": "Manages a list of vehicle variants with add, edit, delete, and feature management functionality.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "Contains React Query hooks for fetching and mutating admin CMS data such as media assets, contacts, and credit simulations.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Empty placeholder export retained for backward compatibility.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Handles admin session management, including validation, login flow, and an emergency bypass mode.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "Provides a UI to test admin login, showing success or error results and token data.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Admin login form with session-based redirects, emergency bypass handling, and error display.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Loads and edits the admin user's profile with a simple form and save mutation.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "CRUD interface for blog posts including search, create/edit dialog, and delete confirmation.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Dashboard showing counts of vehicles, promotions, testimonials, blog posts, contacts, and simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Manages contact form leads and credit simulations with search, tabbed lists, and delete actions.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Media manager page showing upload tools and handling auth errors for media asset retrieval.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "CRUD management page for promotions with search, create/edit dialog, and deletion flow.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Admin page that lists, searches, creates, updates, and deletes testimonials with dialogs and toast feedback.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Admin page for managing vehicles with category filtering, search, CRUD actions, and form dialogs.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Admin interface to display and update visitor statistics with stat cards and a form.",
  "frontend/src/admin/styles/adminTheme.css": "CSS file defining admin-specific color tokens, layout styles, table styling, and UI component themes.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all public and admin pages with layouts, guards, and page components.",
  "frontend/src/components/blog/BlogCommentForm.tsx": "Form component for submitting blog comments with validation, error display, and reset functionality.",
  "frontend/src/components/blog/BlogInteractionsBar.tsx": "Renders like, share, and comment buttons with tooltips and counters for a blog post.",
  "frontend/src/components/forms/ContactForm.tsx": "Implements a contact form that validates required fields and submits contact data via a mutation hook.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Provides a credit simulation request form that validates inputs and sends simulation data through a mutation hook.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that catches rendering errors and shows a fallback UI with a reload option.",
  "frontend/src/components/layout/Footer.tsx": "Displays dealer information, contact details, social media links, and visitor stats in the website footer.",
  "frontend/src/components/layout/PublicLayout.tsx": "Defines the public site layout with navbar, optional hero, content area, CTA section, footer, and visitor tracking.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Creates a mobile bottom bar with quick actions for calling, WhatsApp, credit simulation, and a popup menu.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Shows a slide-up sheet containing the main navigation menu for mobile views.",
  "frontend/src/components/navigation/Navbar.tsx": "Responsive navigation bar with links, WhatsApp CTA, and mobile sheet menu.",
  "frontend/src/components/public/SectionTitle.tsx": "Reusable section title component displaying an icon and heading text.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Bottom call‑to‑action section prompting users to contact via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with welcome message and tagline.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Vehicle display card showing image, pricing, tags, and links to detail or WhatsApp consult.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages authenticated or anonymous backend actors with auto‑refetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, identity state, and AuthClient handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching public data like vehicles, promotions, blogs, and interactions.",
  "frontend/src/hooks/useVisitorTracking.ts": "Hook that tracks visitors and page views using mutation calls and session storage.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables for theming, including light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a full blog post with interactions like likes, shares, and comments, fetching post data and handling meta tags.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog posts with images and previews, linking to individual blog detail pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows detailed information for a commercial vehicle with pricing, features, likes, and sharing options.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Displays categorized commercial vehicles (light, medium, tractor head) filtered from the full vehicle list.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form and displays contact details, location map, and sales consultant info.",
  "frontend/src/pages/HomePage.tsx": "Shows featured vehicles, a CTA banner, about section, vehicle search, and latest blog posts on the homepage.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Displays detailed info for a passenger vehicle, including variants, pricing, images, likes, and sharing actions.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Fetches and lists all published non-commercial passenger vehicles using vehicle cards.",
  "frontend/src/pages/PromoPage.tsx": "Loads and displays current promotions with images, details, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Shows customer testimonials with ratings, profile images, and reviews.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines public and admin routes for smoke testing and provides utilities for route validation and checklist generation.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling plugins.",
  "project_state.json": "Defines project state, architectural constraints, known issues, and requirements for a stable automotive CMS system with backend/frontend separation and admin auth. Serves as a comprehensive status record for debugging, persistence, and admin feature planning."
}