{
  "backend/main.mo": "Defines the main actor with storage mixins, access control, and extensive types plus CRUD-like query and update functions for user profiles and vehicle-related data.",
  "backend/migration.mo": "Provides type definitions matching the main actor and a migration run function that returns old state unchanged.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries for several frontend components and pages.",
  "frontend/index.css": "Tailwind setup defining CSS variables for light/dark themes and applying base styles.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/admin/AdminGuard.tsx": "Protects admin routes by checking Internet Identity, admin status, and redirects or blocks access accordingly.",
  "frontend/src/admin/AdminLayout.tsx": "Admin dashboard layout with sidebar navigation, logout handling, and main content area.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Provides Internet Identity login UI and redirects authenticated admins to the dashboard.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Allows admins to view and update their profile using backend queries and mutations.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Displays blog post count and placeholder UI for future CRUD management.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Displays dashboard stats by fetching counts of vehicles, promotions, testimonials, posts, contacts, and credit simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Shows contacts and credit simulations in tabbed admin view with loading states.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Lists media asset count and provides an upload button placeholder.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Displays total promotions and includes a button to add new ones.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Shows testimonial count and provides a button for adding new entries.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Displays total vehicles and includes an add-vehicle action button.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Fetches and displays visitor statistics such as visitors, users, and page views.",
  "frontend/src/App.tsx": "Configures TanStack Router with public and admin routes, layouts, and pages.",
  "frontend/src/components/forms/ContactForm.tsx": "Form for submitting contact messages with validation and API mutation.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form for submitting credit simulation requests with validation and API integration.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Global error boundary that catches UI errors and shows a refresh prompt.",
  "frontend/src/components/layout/Footer.tsx": "Footer with contact info, social links, branding, and visitor statistics.",
  "frontend/src/components/layout/PublicLayout.tsx": "Public-facing layout with navbar, hero, footer, CTA sections, and visitor tracking.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Mobile bottom action bar providing call, WhatsApp, credit simulation, and menu access using sheets.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Bottom sheet menu listing navigation links and closing on selection.",
  "frontend/src/components/navigation/Navbar.tsx": "Top navigation bar with responsive menu, route links, and WhatsApp contact button.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Call-to-action section prompting users to contact via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Simple hero banner with dealership title and subtitle.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Vehicle display card showing image, details, features, and actions for consult and details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity auth, login, logout, and state management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend API calls for vehicles, content, stats, and mutations.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors and page views using mutations and sessionStorage.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/BlogDetailPage.tsx": "Fetches and displays a single blog post with SEO updates and fallback UI for loading or missing data.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog posts with images, excerpts, and links to detail pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows detailed info for a commercial vehicle with features, pricing, likes, and share actions.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Displays commercial vehicles grouped into light duty, medium duty, and tractor head categories.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form and static contact details including map and consultant bio.",
  "frontend/src/pages/HomePage.tsx": "Home page with banners, featured vehicles, search, about section, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Shows passenger vehicle details with variant selection, dynamic pricing, likes, and share options.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Fetches vehicles, filters passenger types, and displays them in a grid with loading and empty states.",
  "frontend/src/pages/PromoPage.tsx": "Loads promotions and renders each with image, details, and terms, including loading and empty states.",
  "frontend/src/pages/TestimonialsPage.tsx": "Fetches testimonials and displays customer info, star ratings, and reviews with loading and empty states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and session parameters, persist them, and manage hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes project architecture, state, existing features, and known frontend routing/theme issues."
}