{
  "backend/main.mo": "Defines backend actor with storage mixins, admin auth, and data models for vehicles, media, promotions, blogs, contacts, and interactions.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens, theme variables, and dark mode styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/REDEPLOYMENT.md": "Documentation describing how to rebuild, redeploy, and manually validate the frontend canister.",
  "frontend/src/admin/AdminGuard.tsx": "Protects admin routes by validating session, handling emergency bypass mode, and showing loading or access-denied states.",
  "frontend/src/admin/AdminLayout.tsx": "Provides the admin dashboard layout with sidebar navigation, active-state logic, and logout handling.",
  "frontend/src/admin/auth/adminSession.ts": "Manages admin session storage, migration from legacy keys, cookie handling, and bypass session creation.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Enables a temporary authentication bypass with predefined super admin data for debugging.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access-denied message with a button redirecting back to the admin login page.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog form for creating or editing blog posts, managing form state, validation defaults, and image selection.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with configurable text and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table with search, custom column rendering, published status display, and edit/delete actions.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Media management panel that lists, filters, and deletes media assets with error handling and confirmation dialog.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Dialog to search and select a media asset, handling loading, errors, and current selection state.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Button component to upload media files, converting them to data URLs and sending them to the backend with status feedback.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog with form fields to create or edit a promotion, handling state, image selection, and save submission.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog for creating or editing testimonials with fields for customer info, review details, image selection, and save handling.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Complex vehicle editor dialog with tabs for basic info, variants, specs, and commercial features, supporting image and brochure selection.",
  "frontend/src/admin/components/vehicles/CommercialFeaturesEditor.tsx": "Renders a list of commercial vehicle feature checkboxes and updates the feature state on toggle.",
  "frontend/src/admin/components/vehicles/TechnicalSpecsEditor.tsx": "Provides form inputs for technical specs and lets users add or remove additional features.",
  "frontend/src/admin/components/vehicles/VariantsEditor.tsx": "Manages creation, editing, and deletion of vehicle variants with feature lists and pricing adjustments.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "Defines React Query hooks for fetching and mutating admin CMS data such as media assets, contacts, and credit simulations.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Empty placeholder export kept only to avoid breaking imports.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Handles admin session validation, login, logout, and optional emergency bypass logic.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "UI page for testing admin login by manually submitting credentials and viewing the result.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Admin login screen handling authentication, emergency bypass redirects, and form submission.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Admin profile editor allowing viewing and updating user profile fields.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Blog management interface supporting search, create, edit, and delete operations for blog posts.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Dashboard displaying summary stats for vehicles, promotions, testimonials, blogs, contacts, and simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Leads management page for viewing, searching, and deleting contact form entries and credit simulations.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Media manager page showing media assets with upload support and session-expired handling.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Promotions management UI enabling search, creation, editing, and deletion of promotions.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Admin page for listing, searching, creating, editing, and deleting testimonials using dialogs and a CRUD table.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Admin interface to manage vehicles with category filtering, search, and create/edit/delete dialogs.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays visitor stats and provides a form to update stored visitor analytics.",
  "frontend/src/App.tsx": "Configures all public and admin routes using TanStack Router and wires layouts and pages.",
  "frontend/src/components/forms/ContactForm.tsx": "Form for submitting contact inquiries, validating required fields, and sending data via mutation.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form to submit credit simulation requests with validation and mutation-based submission.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Global React error boundary that shows a fallback UI and allows reloading the page on errors.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact info, social links, branding, and a dynamic year.",
  "frontend/src/components/layout/PublicLayout.tsx": "Defines the public page layout with navbar, optional hero, content area, CTA sections, and footer.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Provides a mobile bottom bar with quick actions for calling, WhatsApp, credit simulation, and menu access.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Displays a slide‑up menu sheet listing main navigation links.",
  "frontend/src/components/navigation/Navbar.tsx": "Implements the top navigation bar with logo, links, WhatsApp button, and a mobile sheet menu.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Shows a bottom CTA banner encouraging WhatsApp contact with a call‑to‑action button.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays a simple hero banner with a title and subtitle.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Renders a vehicle card with image, details, price, features, and buttons for details and WhatsApp consultation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating public data such as vehicles, blogs, interactions, contacts, and credit simulations through an actor API.",
  "frontend/src/hooks/useVisitorTracking.ts": "Tracks unique visitors and page views using session storage and mutation hooks.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and base global styles.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post, updates SEO metadata, and handles loading or missing-post states.",
  "frontend/src/pages/BlogListPage.tsx": "Fetches and renders a grid of blog posts with links to detail pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Shows detailed info for a commercial vehicle with liking and sharing actions.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Lists commercial vehicles grouped by category such as light, medium, and tractor head.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form along with static contact details, map, and consultant info.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a banner carousel, featured vehicles, search functionality, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Displays detailed information for a specific passenger vehicle, including variants, pricing, and share/like actions.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all published passenger vehicles with loading and empty-state handling.",
  "frontend/src/pages/PromoPage.tsx": "Shows a list of current promotions with images, descriptions, and validity details.",
  "frontend/src/pages/TestimonialsPage.tsx": "Displays customer testimonials with ratings, images, and review text.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines public and admin routes for smoke testing and provides utilities to generate checklists and validate router configuration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS config enabling dark mode, content scanning, extended color system, custom animations, and typography/container/animate plugins.",
  "project_state.json": "Project metadata describing current architecture, requirements, known issues, and admin/CMS/auth-related constraints for an automotive website platform."
}