{
  "backend/main.mo": "Defines the main backend actor with admin, media, vehicle, promotion, testimonial, blog, contact, and stats types, integrating authorization and blob‑storage mixins.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for reference.",
  "frontend/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML template that loads the React app entry point.",
  "frontend/REDEPLOYMENT.md": "Documentation outlining steps for redeploying the frontend canister and verifying all public and admin routes.",
  "frontend/src/admin/AdminGuard.tsx": "Route guard enforcing admin authentication with an optional emergency bypass mode.",
  "frontend/src/admin/AdminLayout.tsx": "Admin layout component with collapsible sidebar, navigation, session logout handling, and active route detection.",
  "frontend/src/admin/auth/adminSession.ts": "Utilities to get, set, migrate, and clear admin auth sessions using localStorage and cookies.",
  "frontend/src/admin/auth/emergencyBypass.ts": "Enables a temporary admin bypass mode that auto-creates a Super Admin session when enabled.",
  "frontend/src/admin/components/AccessDeniedView.tsx": "Displays an access denied screen with a button redirecting back to the admin login page.",
  "frontend/src/admin/components/AdminPageHeader.tsx": "Reusable admin page header showing a title, optional subtitle, and optional action slot.",
  "frontend/src/admin/components/BlogFormDialog.tsx": "Dialog for creating or editing blog posts with fields, image picker, and admin comment management.",
  "frontend/src/admin/components/ConfirmDeleteDialog.tsx": "Reusable confirmation dialog for delete actions with customizable text and loading state.",
  "frontend/src/admin/components/CrudTable.tsx": "Generic CRUD table with search, custom columns, published status display, and edit/delete actions.",
  "frontend/src/admin/components/media/HomeMainBannerManager.tsx": "Manages the home page slider images with add, remove, reorder, and select-from-library actions.",
  "frontend/src/admin/components/media/MediaManagerPanel.tsx": "Displays and filters all media assets with search and delete functionality.",
  "frontend/src/admin/components/media/MediaPickerDialog.tsx": "Modal for browsing and selecting media assets with search, folder filtering, and error handling.",
  "frontend/src/admin/components/media/MediaUploadButton.tsx": "Button that uploads a selected file, converts it to a data URL, saves it as a media asset, and triggers a callback.",
  "frontend/src/admin/components/PromotionFormDialog.tsx": "Dialog for adding or editing promotions with form fields, image selection, and publish toggle.",
  "frontend/src/admin/components/TestimonialFormDialog.tsx": "Dialog component for creating or editing testimonials with fields for text, rating, image selection, and publish status.",
  "frontend/src/admin/components/VehicleFormDialog.tsx": "Large dialog for creating or editing vehicles, including basic info, media, variants, specs, and commercial options.",
  "frontend/src/admin/components/vehicles/CommercialFeaturesEditor.tsx": "UI component for toggling commercial vehicle feature booleans via checkboxes and emitting updates.",
  "frontend/src/admin/components/vehicles/TechnicalSpecsEditor.tsx": "Editor for vehicle technical specs with inputs and add/remove functionality for additional features.",
  "frontend/src/admin/components/vehicles/VariantsEditor.tsx": "Manages creation, editing, and deletion of vehicle variants, including features and price adjustments.",
  "frontend/src/admin/hooks/useAdminCmsQueries.ts": "React Query hooks wrapping admin CRUD operations for vehicles, promotions, testimonials, and more.",
  "frontend/src/admin/hooks/useAdminLoginDebug.ts": "Deprecated placeholder hook kept for compatibility with no functional logic.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Handles admin session validation, login flow, and optional emergency bypass session creation.",
  "frontend/src/admin/pages/AdminLoginDebugPage.tsx": "Debug page to manually test admin login by submitting credentials and displaying results.",
  "frontend/src/admin/pages/AdminLoginPage.tsx": "Login page handling admin authentication, emergency bypass redirect, and form submission with validation states.",
  "frontend/src/admin/pages/AdminProfilePage.tsx": "Admin profile editor that loads user data, allows updating name/email/phone, and saves changes via CMS hooks.",
  "frontend/src/admin/pages/BlogAdminPage.tsx": "Blog management UI with search, create, edit, and delete operations using CMS mutation hooks.",
  "frontend/src/admin/pages/DashboardPage.tsx": "Dashboard showing counts of vehicles, promotions, testimonials, blog posts, contacts, and credit simulations.",
  "frontend/src/admin/pages/LeadsAdminPage.tsx": "Leads management page to view, search, and delete contact form submissions and credit simulations.",
  "frontend/src/admin/pages/MediaManagerPage.tsx": "Media manager for uploading assets and configuring homepage banners, including main slider and CTA banner.",
  "frontend/src/admin/pages/PromotionsAdminPage.tsx": "Admin page for listing, searching, creating, editing, and deleting promotions using CRUD dialogs and mutation hooks.",
  "frontend/src/admin/pages/TestimonialsAdminPage.tsx": "Admin interface to manage testimonials with filtering, table display, and create/edit/delete dialogs.",
  "frontend/src/admin/pages/VehiclesAdminPage.tsx": "Admin page for managing passenger and commercial vehicles with category filtering, search, and full CRUD operations.",
  "frontend/src/admin/pages/VisitorStatsAdminPage.tsx": "Displays extended visitor statistics in card format with real‑time auto‑refresh and error/loading handling.",
  "frontend/src/admin/styles/adminTheme.css": "Defines layout, sidebar, table, button, and card styling for the admin UI theme.",
  "frontend/src/App.tsx": "Configures all public and admin routes using TanStack Router with layout wrappers.",
  "frontend/src/components/blog/BlogCommentForm.tsx": "Form component for submitting blog comments with validation, reset handling, and optional reply mode.",
  "frontend/src/components/blog/BlogCommentsThread.tsx": "Renders a threaded list of comments with reply capability and nested reply forms.",
  "frontend/src/components/blog/BlogInteractionsBar.tsx": "Displays like, share, and comment buttons with counters and local like state persistence.",
  "frontend/src/components/forms/ContactForm.tsx": "Collects and submits contact inquiry data with validation, API mutation, and form reset.",
  "frontend/src/components/forms/CreditSimulationForm.tsx": "Form for requesting a credit simulation, validating required fields and sending data via mutation.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that catches fatal errors and shows a fallback UI with a reload option.",
  "frontend/src/components/home/HomeMainBannerSlider.tsx": "Auto-rotating banner slider that cycles through images with simple animation and static fallback.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact info, social links, operational hours, and visitor stats.",
  "frontend/src/components/layout/PublicLayout.tsx": "Defines the public page layout with navbar, optional hero, content area, CTA section, footer, and visitor tracking.",
  "frontend/src/components/navigation/BottomCtaBar.tsx": "Provides a mobile bottom bar with call, WhatsApp, credit simulation, and navigation menu actions.",
  "frontend/src/components/navigation/MainMenuSheet.tsx": "Shows a bottom-sheet menu listing main navigation links for mobile.",
  "frontend/src/components/navigation/Navbar.tsx": "Creates the top navigation bar with brand logo, links, WhatsApp button, and mobile slide-out menu.",
  "frontend/src/components/public/SectionTitle.tsx": "Displays a styled section title with an icon and customizable text.",
  "frontend/src/components/sections/BottomCTASection.tsx": "Renders a CTA section prompting users to contact via WhatsApp.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays a simple hero banner with title and subtitle.",
  "frontend/src/components/vehicles/VehicleCard.tsx": "Shows a vehicle card with image, price, features, and links to details or WhatsApp consult.",
  "frontend/src/hooks/useActor.ts": "Provides an actor instance tied to authentication, auto-initializing access control and refreshing related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, clear, and login status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as vehicles, blog posts, interactions, comments, promotions, and testimonials.",
  "frontend/src/hooks/useVisitorTracking.ts": "Implements visitor tracking using mutations to record unique visitors, page views, and periodic presence updates tied to a session ID.",
  "frontend/src/index.css": "Sets up Tailwind layers, CSS variables for themes, global styles, and animations for banners and responsive layout adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlogDetailPage.tsx": "Renders a detailed blog post view with likes, shares, comments, and interaction tracking, including comment submission handling.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a grid of blog posts with loading state, basic metadata, and links to individual blog detail pages.",
  "frontend/src/pages/CommercialVehicleDetailPage.tsx": "Displays detailed info for a commercial vehicle, including variants, pricing adjustments, features, and contact actions.",
  "frontend/src/pages/CommercialVehiclesPage.tsx": "Lists all published commercial vehicles grouped into light duty, medium duty, and tractor head categories.",
  "frontend/src/pages/ContactPage.tsx": "Shows a contact form along with dealer contact info, location map, and sales consultant details.",
  "frontend/src/pages/HomePage.tsx": "Displays home sections including banner slider, featured vehicles, CTA banner, about info, and latest blog posts.",
  "frontend/src/pages/PassengerVehicleDetailPage.tsx": "Shows detailed info for a passenger vehicle with variant selection, pricing, and contact options.",
  "frontend/src/pages/PassengerVehiclesPage.tsx": "Lists all published passenger vehicles in a grid layout with loading and empty states.",
  "frontend/src/pages/PromoPage.tsx": "Renders a list of promotions with images, descriptions, expiry dates, and terms.",
  "frontend/src/pages/TestimonialsPage.tsx": "Displays customer testimonials with ratings, images, and reviews.",
  "frontend/src/redeploy/routeSmoke.ts": "Defines public and admin route lists for manual smoke testing and provides utilities to generate checklists and validate router configuration.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color tokens, animations, container settings, and plugins.",
  "project_state.json": "Tracks project state, architecture notes, known issues, and constraints for an automotive website with admin CMS and stable persistence."
}