{
  "kind": "build_request",
  "title": "Fix Admin Visitor Stats layout, Admin Profile saving, Admin UI consistency, and add homepage banner controls in Media",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-137",
      "text": "Update the Admin Visitor Statistics page so the statistic cards render in a 2 x 5 grid layout (2 columns, up to 5 rows) with no horizontal overflow on any screen size, replacing the current layout that scrolls too far to the right.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "- Grid kartu statistik pada admin panel terlalu panjang ke kanan, tolong rubah agar grid dibuat 2 x 5."
        ]
      },
      "acceptanceCriteria": [
        "On /admin/stats, the statistics cards are laid out as 2 columns and wrap into rows (up to 5 rows) without requiring horizontal scrolling.",
        "No stat cards are cut off or overflow the page horizontally at common breakpoints (mobile/tablet/desktop).",
        "The existing metrics shown (and their values) remain unchanged; only the layout/overflow behavior is fixed."
      ]
    },
    {
      "id": "REQ-138",
      "text": "Fix the Admin User Profile page so an admin can reliably save/update profile information and the changes persist and are reloaded correctly on refresh.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "- Saya tidak bisa menyimpan profil information pada user admin profil, tolong perbaiki agar bisa menyimpan data profil dan berfungsi dengan baik."
        ]
      },
      "acceptanceCriteria": [
        "On /admin/profile, editing Name/Email/Phone and clicking “Save Changes” successfully persists the updated profile without errors.",
        "After saving, reloading the page shows the newly saved profile values.",
        "Profile save/load uses admin session-based authorization (the same session token used by other /admin CMS calls) and does not depend on caller Principal-based “user” permissions.",
        "Any success/error messages shown to the admin remain in English (e.g., existing toasts)."
      ]
    },
    {
      "id": "REQ-139",
      "text": "Polish and normalize the Admin panel UI styling for a more aesthetic and consistent look, and ensure the currently selected sidebar/menu item has a clear red accent highlight.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "- Rapihkan tampilan UI admin panel agar lebih estetik dan seragam, beri aksen warna merah pada menu yang dipilih."
        ]
      },
      "acceptanceCriteria": [
        "The active sidebar item in /admin clearly displays a red accent highlight state that is visually distinct from hover and inactive states.",
        "The active-state styling works correctly across all admin routes, including query-string routes like /admin/vehicles?category=passenger vs /admin/vehicles?category=commercial.",
        "Admin UI changes are visual-only (no route changes, no data wiring changes)."
      ]
    },
    {
      "id": "REQ-140",
      "text": "Add admin functionality inside the /admin Media area to manage the Home page Main Banner image (rendered directly below the Navbar) and the Home page CTA Banner image, so admins can replace those two homepage images from the admin panel using existing Media Assets (upload/select).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "- Tambahkan fungsi didalam menu Media pada admin panel agar membuat menu untuk mengganti gambar Main Banner dan gambar CTA Banner dihalaman utama, gambar Main Banner terletak tepat dibawah navbar yang saat ini berupa hero section berwarna merah dihalaman utama."
        ]
      },
      "acceptanceCriteria": [
        "In /admin/media, there is a clearly labeled admin-only section (English text) that allows selecting (and/or uploading then selecting) a Media Asset for (1) “Home Main Banner” and (2) “Home CTA Banner”, and saving those selections.",
        "The selected banner settings persist in canister stable storage and survive refresh/redeploy/upgrade according to the project’s persistence approach.",
        "On the public Home page (/), the “Main Banner” image renders directly below the Navbar and replaces the current red HeroSection on the Home page only (other public pages keep the existing red hero section behavior).",
        "On the public Home page (/), the CTA banner image uses the admin-configured CTA Banner asset; if not configured, the page falls back to the current existing CTA banner behavior (e.g., the current static CTA Banner image).",
        "No admin panel routes are changed; this is added within the existing /admin/media page and the existing public Home page route."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (immutable shadcn components).",
    "Keep the existing TanStack Router route structure intact; add functionality within existing pages/routes.",
    "Use English for any new user-facing text added in the admin UI.",
    "Backend must remain a single Motoko actor (backend/main.mo). Add backend state migration (backend/migration.mo) only if required for upgrade-safe state changes.",
    "Do not remove or break existing Media Manager listing/upload/delete behavior; banner controls must be additive."
  ],
  "nonGoals": [
    "Adding a new public page or changing public navigation structure.",
    "Introducing third-party storage/CDNs for banner images (must use the existing canister-backed Media Manager assets).",
    "Changing the set of visitor-stat metrics displayed on the admin stats page beyond fixing the layout.",
    "Implementing a multi-image homepage slider/carousel (only a single Main Banner image and a single CTA Banner image are required)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}