{
  "kind": "build_request",
  "title": "Backend storage foundation injection: full stable persistence + upgrade-safe restore",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Replace all in-memory collections in `backend/main.mo` with upgrade-safe stable persistence so that data survives draft rebuilds, canister upgrades, and version redeploys.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Upgrade current project storage system to FULL STABLE PERSISTENCE.",
          "Replace all in-memory maps with stable storage",
          "Data must survive: Draft rebuild, Canister upgrade, Version redeploy"
        ]
      },
      "acceptanceCriteria": [
        "No application data is stored only in `let ... = Map.empty(...)` (or other volatile/in-memory variables) without being serialized to stable storage during upgrades.",
        "After inserting records into each collection, performing a canister upgrade preserves all records and they are returned identically by existing query/update APIs.",
        "After a redeploy that triggers the canister’s initialization + upgrade lifecycle, previously persisted stable data is automatically restored into the live in-canister working state (if any runtime state is needed)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Create and persist stable collections for the following domain datasets: `passengerVehicles`, `commercialVehicles`, `promotions`, `testimonials`, `blogPosts`, `contacts`, `creditSimulations`, `adminUsers`, `visitorStats`, `mediaAssets`. Ensure the stable schema is explicitly defined and versioned to allow safe future upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Create stable collections:\n\npassengerVehicles\ncommercialVehicles\npromotions\ntestimonials\nblogPosts\ncontacts\ncreditSimulations\nadminUsers\nvisitorStats\nmediaAssets"
        ]
      },
      "acceptanceCriteria": [
        "Stable storage contains an explicitly defined structure for each named collection (not a single combined map unless it also provides these named logical collections).",
        "`visitorStats` is persisted in stable storage (not only a `var`) and survives upgrade/redeploy with the same counter values.",
        "Vehicle data is persisted in two stable collections (`passengerVehicles` and `commercialVehicles`) rather than relying on a volatile filter flag; any existing combined representation must be mapped into these two stable collections in an upgrade-safe way."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Create and persist stable interaction collections: `productLikes`, `productShares`, `articleLikes`, `articleComments`. Map or split any existing combined interaction state (e.g., a single `productInteractions` map) into these stable collections without data loss.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Interaction collections:\n\nproductLikes\nproductShares\narticleLikes\narticleComments"
        ]
      },
      "acceptanceCriteria": [
        "Each interaction dataset is stored in its own stable collection with a clear keying strategy (e.g., by product/article id and optionally principal where relevant).",
        "Existing public interaction APIs (e.g., product like/share) continue to function and their counters persist across upgrade/redeploy.",
        "If the prior implementation stored likes/shares together, the upgraded stable data correctly populates the new `productLikes`/`productShares` collections and returns consistent results after upgrade."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Implement upgrade-safe lifecycle hooks and data mapping that automatically saves to stable state on upgrade and restores on deploy/upgrade, including handling schema evolution and backward-compatible decoding from prior in-memory layouts.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Ensure upgrade-safe data mapping",
          "Add auto-restore lifecycle mapping on deploy."
        ]
      },
      "acceptanceCriteria": [
        "`preupgrade` persists all required runtime state into stable variables.",
        "`postupgrade` restores state from stable variables into runtime variables (if runtime variables remain) and the canister remains functional without manual admin actions.",
        "A schema/version field (or equivalent) is used to distinguish persisted data formats and perform conditional migrations when formats differ.",
        "If prior versions stored data only in in-memory maps, the canister does not trap on upgrade; it should either (a) initialize empty stable collections safely, or (b) migrate from any prior stable representation if it existed."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Keep the backend public interface compatible with the existing frontend (no UI changes): preserve existing method names and argument/return types where currently used, and add internal mapping so existing endpoints continue to read/write the new stable collections.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Do NOT modify UI.\nDo NOT modify layout.\nBackend injection only."
        ]
      },
      "acceptanceCriteria": [
        "No frontend code changes are required for the app to compile and run against the updated backend.",
        "Existing backend methods in `backend/main.mo` (e.g., `getVehicles`, `getPromotions`, `getTestimonials`, `getBlogPosts`, `addContact`, `addCreditSimulation`, interaction APIs, visitor stats APIs) still exist and behave consistently, backed by the new stable collections.",
        "Any required internal data transformations (e.g., combining passenger+commercial into `getVehicles` output) are implemented entirely in the backend."
      ]
    }
  ],
  "constraints": [
    "Backend changes only; do not modify UI or layout (no frontend edits).",
    "Respect the single-actor backend architecture: all Motoko logic remains in `backend/main.mo`.",
    "Use English for any user-facing text produced by backend traps/errors.",
    "Do not introduce external databases or services; persistence must be implemented with canister stable storage."
  ],
  "nonGoals": [
    "Redesigning or refactoring frontend components, routes, or styling.",
    "Adding new product features beyond stable persistence + upgrade/redeploy-safe restore for the specified collections.",
    "Changing authentication provider(s) or adding third-party auth integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}