{
  "kind": "build_request",
  "title": "Enhance public blog interactions: Like label + one-like-per-visitor, threaded comments with admin moderation, and article view counter activation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-116",
      "text": "Update the public Blog interactions bar so the Like action includes a visible text label \"Like\" (to match the existing \"Share\" and \"Comment\" label style), and restrict Like so each visitor can only like a given blog article once per blogPostId.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Tambahkan text 'Like' pada icon Love seperti pada icon share dan komen agar serasi.",
          "Batasi klik Like agar setiap pengunjung hanya dapat mengklik Like 1x disetiap halaman artikel. Hanya Like, untuk share dan komentar bebas."
        ]
      },
      "acceptanceCriteria": [
        "On the public Blog Detail page, the Like button shows the text label \"Like\" next to the heart icon and count.",
        "After a visitor successfully likes an article once, subsequent clicks for the same article do not call the backend increment-like mutation again and the Like control is visibly disabled or otherwise prevented from re-liking for that same visitor.",
        "The one-like-per-visitor restriction is scoped per blogPostId (liking one article does not block liking other articles).",
        "Share and Comment actions remain unrestricted (no per-visitor limitation added)."
      ]
    },
    {
      "id": "REQ-117",
      "text": "Display the published blog comments directly below the article content on the public Blog Detail page, and support threaded replies so visitors can reply to an existing comment and see replies rendered nested under the parent comment.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Tampilkan langsung komentar yang sudah di posting pengunjung dibawah artikel. Dapat diedit dan dihapus diadmin panel.",
          "Buat komentar yang tampil bisa dibalas oleh pengunjung lain."
        ]
      },
      "acceptanceCriteria": [
        "The public Blog Detail page renders a comment list section below the article (and below the interactions/form area), showing existing comments for that blogPostId.",
        "The comment list supports replies: each top-level comment can be replied to, and replies render nested under their parent comment.",
        "After submitting a new comment or a reply, the UI updates so the new item appears in the list without requiring a full page refresh.",
        "Any new user-facing text introduced for the comments list/replies UI (buttons, placeholders, empty states, validation) is in English."
      ]
    },
    {
      "id": "REQ-118",
      "text": "Extend the backend blog comment data model and APIs to support threaded comments (replies) and provide admin-only moderation capabilities to edit and delete individual comments/replies from the existing /admin Blog management experience.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Dapat diedit dan dihapus diadmin panel.",
          "Buat komentar yang tampil bisa dibalas oleh pengunjung lain."
        ]
      },
      "acceptanceCriteria": [
        "Backend supports storing a comment as either a top-level comment or a reply tied to a parent comment (threaded structure) in stable, upgrade-safe persistence.",
        "Public API supports: (1) fetching approved comments (including replies) for a blogPostId, and (2) creating a top-level comment or a reply for a blogPostId.",
        "Admin API supports: editing an individual comment (at minimum the content) and deleting an individual comment (whether top-level or reply).",
        "The existing admin Blog editor dialog (/admin blog management area) is updated so admins can edit and delete individual comments (not only delete-all), and the admin UI remains in English for any new text added."
      ]
    },
    {
      "id": "REQ-119",
      "text": "Activate the article Views counter so that visiting a public Blog Detail page increments that blog post’s views count, and the updated views value is reflected in the existing admin panel views counter for the same article.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Aktifkan Views counter halaman artikel yang sudah ada pada admin panel."
        ]
      },
      "acceptanceCriteria": [
        "When a visitor opens a Blog Detail page, the system increments that blog post’s views count via a backend method, and the blog post’s views value returned by the public blog post query reflects the increment.",
        "The view increment occurs at most once per visitor per article within a reasonable single browsing session (to avoid multiple increments from re-renders/navigation loops).",
        "The /admin Blog management UI shows the same views value for the article as stored in the backend (i.e., the counter used by admin is actually updated by public visits).",
        "Any new user-facing text introduced by this change is in English."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose only).",
    "Keep the existing public blog page layout structure intact beyond adding the requested comment list/replies rendering below the article and minor label additions in the interactions bar.",
    "Backend must remain single-actor (all Motoko logic in backend/main.mo). Only add backend/migration.mo changes if a stable-state upgrade is required by the data model changes.",
    "Use English for any new user-facing text introduced by these changes (public and admin)."
  ],
  "nonGoals": [
    "Do not add any per-visitor restriction for Share or Comment beyond the requested Like limitation.",
    "Do not introduce third-party authentication or external databases/services.",
    "Do not redesign the overall admin layout or change admin routes; only extend the existing blog management/editor experience to support comment edit/delete and replies moderation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any new user-facing text introduced by blog interaction/comment/view changes."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}