{
  "kind": "build_request",
  "title": "Re-implement blog post interactions (love/share/comments) with stable persistence without breaking pages or existing data",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-107",
      "text": "Add a minimal blog post interactions UI to the public Blog Detail page that renders a left-aligned horizontal row of 3 small, aesthetic, minimalist icons directly below the article content area: (1) Love with a visible count formatted like \"❤️ (7)\" (use the current blog post’s persisted like count), (2) Share (click triggers share action tracking), and (3) Comment (toggles the comment form visibility). This must be an additive change that does not alter the existing blog article layout structure beyond inserting this interaction block.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5",
          "recent-messages-8"
        ],
        "quotes": [
          "Tambahkan Icon kecil estetik dan minimalis dibawah postingan blog (contoh : ❤️ (7)) , yaitu icon Love untuk menyukai, share untuk membagikan halaman, dan komentar untuk komen artikel, letakkan icon berjajar tepat dibawah artikel sebelah kiri. Kolom komentar : (Nama, Email, Komentar) akan muncul dibawahnya ketika icon komentar di klik.",
          "Ya kerjakan ulang dengan benar jangan sampai merusak struktur halaman dan database."
        ]
      },
      "acceptanceCriteria": [
        "On `/blog/$id`, a 3-icon interaction row appears directly under the article (left-aligned): Love (with count), Share, Comment.",
        "The Love count is rendered in the format \"❤️ (N)\" where N matches persisted data for that blog post.",
        "Clicking the Comment icon toggles a comment form area directly below the icons; clicking again hides it.",
        "No other public page structure or routing changes occur as part of this requirement."
      ]
    },
    {
      "id": "REQ-108",
      "text": "Implement the public comment form UI that appears under the blog interaction icons when Comment is clicked, with exactly these fields: Name, Email, Comment. Submitting the form must persist the comment to the canister and then clear the form and update the displayed comment count/state for that post. Use English for any new user-facing text introduced by this feature (placeholders, buttons, validation errors, empty states).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Kolom komentar : (Nama, Email, Komentar) akan muncul dibawahnya ketika icon komentar di klik."
        ]
      },
      "acceptanceCriteria": [
        "The comment form includes inputs for Name, Email, and Comment, and a submit button.",
        "Submitting creates a persisted comment for the current blog post and resets the form on success.",
        "After successful submit, the UI refreshes interaction data (at least comment count) without a full page reload.",
        "All newly introduced user-facing strings for this feature are in English."
      ]
    },
    {
      "id": "REQ-109",
      "text": "Add canister-backed, upgrade-safe stable persistence for blog post interactions: article likes, article shares, and article comments. This must be implemented as additive collections (do not remove or repurpose existing collections) and must not break or change existing method signatures that the current frontend/admin already uses (e.g., existing blog CRUD).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5",
          "recent-messages-8"
        ],
        "quotes": [
          "Simpan di stable database dan editor blog dipanel admin.",
          "jangan sampai merusak struktur stable database dan panel admin yang sudah bagus."
        ]
      },
      "acceptanceCriteria": [
        "There are dedicated persistent data structures for: (a) per-blog-post likes count, (b) per-blog-post share counts (at least total, optionally by platform), and (c) comments with fields name/email/comment and timestamps, associated to a blogPostId.",
        "Interaction data survives canister redeploy/upgrade according to the project’s stable persistence approach.",
        "Existing blog post CRUD behavior and data (BlogPost records) continue to load and save as before."
      ]
    },
    {
      "id": "REQ-110",
      "text": "Expose new backend methods required for the public blog interactions flow: (1) fetch interaction summary for a given blogPostId (at minimum: likesCount, sharesCount, commentsCount), (2) increment like for a given blogPostId, (3) increment share for a given blogPostId (accept a platform string), (4) add a comment for a given blogPostId with Name/Email/Comment, and (5) fetch comments for a given blogPostId for public display if needed by the UI. These methods must be safe to call from the public site and must not require admin session tokens.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Tambahkan Icon kecil estetik dan minimalis dibawah postingan blog ... Love ... share ... komentar ...",
          "Simpan di stable database ..."
        ]
      },
      "acceptanceCriteria": [
        "Backend provides callable methods to like, share, and comment on a blog post from the public frontend without admin authentication.",
        "Backend provides a query to retrieve the interaction counts for a blog post.",
        "Backend provides a query to retrieve comments for a blog post (even if the UI initially only uses counts).",
        "All methods return consistent results across repeated calls, and interaction counts reflect persisted values."
      ]
    },
    {
      "id": "REQ-111",
      "text": "Wire the new blog-interaction backend methods into the React Query public hooks layer (`frontend/src/hooks/useQueries.ts`) and integrate them into `frontend/src/pages/BlogDetailPage.tsx` so the interaction row (Love count, Share, Comment toggle + form submission) works end-to-end without breaking existing blog loading, SEO metadata behavior, or page rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5",
          "recent-messages-8"
        ],
        "quotes": [
          "Pembaruan ini hanya penambahan fitur untuk interaksi dengan pengunjung, jangan sampai merusak struktur stable database ...",
          "Ya kerjakan ulang ... jangan sampai merusak struktur halaman ..."
        ]
      },
      "acceptanceCriteria": [
        "`useQueries.ts` includes new hooks for article interactions and these hooks call the new backend methods.",
        "`BlogDetailPage.tsx` continues to load and render the blog content exactly as before, plus the new interaction UI.",
        "Like/share/comment actions update counts via React Query invalidation/refetch (no hard refresh required).",
        "No changes are introduced to immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-112",
      "text": "Extend the /admin Blog editor experience (without changing existing routes or overall admin layout) to surface blog interaction data and allow comment moderation within the admin blog management area. At minimum: show read-only interaction counts for the selected blog post and provide an admin-only view to list comments for that post and delete them. All admin user-facing text introduced must be in English.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Simpan di stable database dan editor blog dipanel admin."
        ]
      },
      "acceptanceCriteria": [
        "In the /admin blog management flow, an admin can view interaction counts for a blog post (likes/shares/comments).",
        "Admins can view a list of comments for a blog post and delete individual comments.",
        "Comment deletion persists (deleted comments no longer appear after refresh).",
        "No existing admin blog CRUD (create/edit/publish/delete posts) is broken by these additions.",
        "All newly introduced admin UI text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not break existing public page structure, routing, or SEO behavior; only add the blog interaction block and comment UI under the blog article in Blog Detail.",
    "Do not change or remove existing backend method signatures currently used by the frontend/admin for blog CRUD; add new methods for interactions instead.",
    "Do not corrupt, reset, or lose existing persisted CMS content; interaction persistence must be additive and upgrade-safe.",
    "Do not modify any frontend files listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any new user-facing text added by this change (public and admin)."
  ],
  "nonGoals": [
    "Implementing third-party social APIs for sharing (only track share actions and optionally open standard share links).",
    "Adding real-time/live comment updates across multiple clients.",
    "Adding Internet Identity requirements for liking/sharing/commenting beyond what the app already uses."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}