{
  "kind": "build_request",
  "title": "Fix Admin CMS regression: media not visible in editors and save/publish failing",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-84",
      "text": "Fix backend admin authorization error handling so Admin CMS and Media Manager operations do not trap on invalid/expired sessions, and instead return a safe unauthorized response that the current React Query hooks can handle (so the UI can show session-expired messaging and continue functioning after re-login). Apply this consistently to admin CMS methods used by the admin UI, including: getMediaAssets/createMediaAsset/deleteMediaAsset, create/update/delete Vehicle/Promotion/Testimonial/BlogPost, getContacts/deleteContact, getCreditSimulations/deleteCreditSimulation, getVisitorStats/updateVisitorStats.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Media belum bisa muncul di editor, malah sekarang jadi tidak bisa simpan dan publish"
        ]
      },
      "acceptanceCriteria": [
        "When calling admin CMS methods with an invalid/expired token, the backend returns an unauthorized value (e.g., null/err variant) instead of trapping with a canister error.",
        "With a valid token, all admin CMS methods listed in this requirement succeed without trapping.",
        "No new non-English user-facing text is introduced by backend errors; any string messages returned must be English."
      ]
    },
    {
      "id": "REQ-85",
      "text": "Ensure the Admin Media Manager asset listing and editor Media Picker can successfully load and display existing media assets end-to-end (list, search, select) using the existing session token stored under `caffeineAdminSession`, without requiring any frontend storage-key changes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Media belum bisa muncul di editor"
        ]
      },
      "acceptanceCriteria": [
        "If media assets exist in canister storage, they appear in `/admin/media` and in MediaPicker dialogs used by editors (Vehicle/Promotion/Testimonial/Blog).",
        "If no media assets exist, the existing empty-state UI remains visible (e.g., “No media yet.”) and no unhandled exceptions occur.",
        "Media list loading does not fail due to authorization when the user is logged in and a valid `caffeineAdminSession.token` exists."
      ]
    },
    {
      "id": "REQ-86",
      "text": "Restore Admin CMS save and publish functionality for all content editors (Vehicles, Promotions, Testimonials, Blog) so that create/update operations persist successfully and the published/draft toggle changes are saved and reflected in the listing tables after saving.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "malah sekarang jadi tidak bisa simpan dan publish"
        ]
      },
      "acceptanceCriteria": [
        "From each admin management page (Vehicles, Promotions, Testimonials, Blog), creating a new item and saving succeeds without errors and the item appears in the table.",
        "Editing an existing item and saving persists changes and the table updates after save (via existing React Query invalidation).",
        "Toggling Published/Draft and saving persists and the status badge in the CRUD table updates accordingly.",
        "If the session is missing/expired, the UI shows the existing English session-required/session-expired messaging instead of silently failing."
      ]
    },
    {
      "id": "REQ-87",
      "text": "Add minimal, backend-side diagnostic logging (console Debug.print) for admin CMS mutation failures related to session validation (invalid/expired token) and for media asset listing failures, to make future deployment issues easier to diagnose without changing any public or admin UI.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-8"
        ],
        "quotes": [
          "malah sekarang jadi tidak bisa simpan dan publish",
          "Kenapa gagal, ok tray again"
        ]
      },
      "acceptanceCriteria": [
        "When an admin CMS call is rejected due to missing/invalid/expired session token, a single-line debug log is emitted indicating the method name and rejection reason (English).",
        "No sensitive data is logged (no passwords, no full tokens; token may be truncated or omitted)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in `backend/main.mo`).",
    "Do not edit frontend files under the immutable paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`).",
    "Use English for any user-facing text introduced or modified by this change."
  ],
  "nonGoals": [
    "Do not redesign the admin UI or add new admin CMS features beyond fixing the regression.",
    "Do not introduce new authentication providers or change the browser storage key strategy (must keep using `caffeineAdminSession`).",
    "Do not add external databases or services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}