{
  "kind": "build_request",
  "title": "Paginate media asset listing to avoid IC 2MB response limit",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-148",
      "text": "Update the backend media listing so the admin Media Manager can load large libraries without triggering the Internet Computer 2MB per-response payload limit. Implement pagination/chunking for listing media assets so no single call returns a payload > 2MB.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "Perbaiki backend media agar getMediaAssets() menggunakan pagination/chunk agar tidak melewati limit 2MB IC.",
          "application payload size (2392377) cannot be larger than 2097152"
        ]
      },
      "acceptanceCriteria": [
        "Calling the media-asset listing API with a large number of media assets no longer results in an IC reject with 'application payload size ... cannot be larger than 2097152'.",
        "Backend provides a paginated/chunked way to fetch media assets (e.g., page size/limit + cursor/offset) such that each response is safely below 2MB even for very large libraries.",
        "Pagination ordering is stable across pages (deterministic ordering by id or created order) so the frontend can safely merge pages.",
        "The paginated listing method requires the same admin session token authorization as existing admin CMS methods (no public access)."
      ]
    },
    {
      "id": "REQ-149",
      "text": "Keep the existing admin Media Manager UI behavior unchanged while adapting the data-fetching layer to use the new paginated/chunked backend listing so the UI still receives a single combined MediaAsset[] result.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Jangan ubah tampilan atau hal yang tidak diperintahkan."
        ]
      },
      "acceptanceCriteria": [
        "No visual/layout changes are made to the /admin Media Manager pages or components; only data-fetching behavior changes are allowed.",
        "The React Query hook used by the admin media library continues to resolve to a single array of MediaAsset items (same shape as before) and the existing grid renders as it does today.",
        "The admin Media page loads successfully with large media libraries and displays media assets without showing the payload-size error.",
        "If a page fetch fails, the error handling remains consistent with current behavior (e.g., MediaManagerPanel shows an error message); no new user-facing copy is introduced unless strictly required, and any new text is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not modify any immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Do not change admin/public UI visuals, layout, routes, or storage keys; only minimal frontend data-fetching changes are allowed to support pagination.",
    "Use English for any user-facing text introduced by these changes."
  ],
  "nonGoals": [
    "Redesigning the Media Manager UI (grid layout, search UI, buttons, styling).",
    "Changing how media upload works or changing media file formats/compression behavior.",
    "Migrating or altering existing stored media assets beyond what is strictly necessary to support paginated listing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}