{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Visitor Statistics: show extended metrics + auto-refresh (Footer unchanged)",
  "requirements": [
    {
      "id": "REQ-128",
      "summary": "Expand the Admin Visitor Statistics page to display all requested extended metrics with consistent admin styling and English-only new text.",
      "acceptanceCriteria": [
        "Admin Visitor Statistics page shows cards/fields for all requested metrics (including Yesterday/Weekly/Monthly/Yearly/Online).",
        "Any newly added labels/help text/toasts introduced by this change are in English.",
        "Existing admin layout/routes remain unchanged (only the Visitor Stats content is expanded)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/pages/VisitorStatsAdminPage.tsx",
          "operation": "modify",
          "description": "Replace the current 4-metric/admin-edit UI with a read-only extended metrics dashboard that renders: Total Visitors, Today Visitors, Yesterday Visitors, Weekly Visitors, Monthly Visitors, Yearly Visitors, Online Visitors, and Page Views, using existing admin card classes (e.g., admin-stat-card/title/value) and English labels."
        },
        {
          "path": "frontend/src/admin/hooks/useAdminCmsQueries.ts",
          "operation": "modify",
          "description": "Add/adjust an admin query hook that fetches ExtendedVisitorStats via the existing authenticated backend capability (getExtendedVisitorStats(sessionToken)), and update Visitor Stats-related imports/types used by the admin page."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update frontend backend typings to include the VisitorStats type (Footer/public shape) and ensure admin typing for ExtendedVisitorStats aligns with the fields required by the admin page (todayTraffic, yesterdayTraffic, weeklyTraffic, monthlyTraffic, yearlyTraffic, onlineVisitors, totalVisitors, pageViews)."
        }
      ]
    },
    {
      "id": "REQ-129",
      "summary": "Add automatic refresh on the Admin Visitor Statistics page with near-real-time polling for Online Visitors and periodic refresh for other metrics.",
      "acceptanceCriteria": [
        "Online Visitors value updates automatically via client polling (e.g., React Query refetchInterval) without a full page reload.",
        "Non-real-time counters also refresh automatically on an interval appropriate for admin monitoring.",
        "No changes are made to public (non-/admin) pages as part of implementing admin refresh behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/hooks/useAdminCmsQueries.ts",
          "operation": "modify",
          "description": "Configure the Extended Visitor Stats admin query hook with React Query polling (refetchInterval) and sensible caching (e.g., small staleTime) so Online Visitors updates near-real-time while other counters refresh automatically."
        },
        {
          "path": "frontend/src/admin/pages/VisitorStatsAdminPage.tsx",
          "operation": "modify",
          "description": "Wire the page to the polling hook and ensure loading/error states remain consistent with admin styling; keep all new user-facing text in English."
        }
      ]
    },
    {
      "id": "REQ-130",
      "summary": "Ensure the public Footer continues to show only the existing four visitor-stat rows with no markup/layout changes, while keeping values sourced from backend-tracked data.",
      "acceptanceCriteria": [
        "No markup/layout changes are made to frontend/src/components/layout/Footer.tsx that would alter what is displayed (still 4 rows: Total Visitors, Active Users, Page Views, Today Traffic).",
        "Footer does not display any of the new admin-only metrics (Yesterday/Weekly/Monthly/Yearly/Online).",
        "Footer values are sourced from backend-tracked values (not hardcoded), with behavior consistent with existing site expectations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Do not change the Footer’s visitor-stats markup/rows; only verify that it still renders exactly the same four items and does not introduce any admin-only metrics."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement useGetPublicVisitorStats to actually fetch the existing public visitor stats shape from the backend (totalVisitors, activeUsers, pageViews, todayTraffic) and optionally poll at a reasonable interval so Footer values reflect backend-tracked real-time behavior (without changing the Footer UI)."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Ensure the backend interface typing includes the public visitor stats read capability used by useGetPublicVisitorStats and includes a VisitorStats type matching the Footer’s four displayed fields."
        }
      ]
    }
  ]
}