{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Public blog interactions: like label + per-visitor like limit, threaded comments with moderation UI, and session-scoped view increments",
  "requirements": [
    {
      "id": "REQ-116",
      "summary": "Add a visible \"Like\" label in the interactions bar and prevent repeat likes per visitor per blogPostId on the public Blog Detail page.",
      "acceptanceCriteria": [
        "On the public Blog Detail page, the Like button shows the text label \"Like\" next to the heart icon and count.",
        "After a visitor successfully likes an article once, subsequent clicks for the same article do not call the backend increment-like mutation again and the Like control is visibly disabled or otherwise prevented from re-liking for that same visitor.",
        "The one-like-per-visitor restriction is scoped per blogPostId (liking one article does not block liking other articles).",
        "Share and Comment actions remain unrestricted (no per-visitor limitation added)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/blog/BlogInteractionsBar.tsx",
          "operation": "modify",
          "description": "Update the Like control UI to include the text label \"Like\" (matching the existing Share/Comment label style), and implement per-visitor per-blogPostId like guarding using browser storage (e.g., localStorage key scoped by blogPostId) so repeat clicks do not call onLike and the control is visibly disabled once liked."
        },
        {
          "path": "frontend/src/pages/BlogDetailPage.tsx",
          "operation": "modify",
          "description": "Wire the new per-visitor like state into the Blog Detail page flow so the UI reflects the one-like-per-visitor behavior for the current blogPostId without affecting Share/Comment behavior."
        }
      ]
    },
    {
      "id": "REQ-117",
      "summary": "Render published comments below the article on the public Blog Detail page and support threaded replies with nested display and live UI updates after submit.",
      "acceptanceCriteria": [
        "The public Blog Detail page renders a comment list section below the article (and below the interactions/form area), showing existing comments for that blogPostId.",
        "The comment list supports replies: each top-level comment can be replied to, and replies render nested under their parent comment.",
        "After submitting a new comment or a reply, the UI updates so the new item appears in the list without requiring a full page refresh.",
        "Any new user-facing text introduced for the comments list/replies UI (buttons, placeholders, empty states, validation) is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/blog/BlogCommentForm.tsx",
          "operation": "modify",
          "description": "Extend the comment form to support replying (e.g., accept an optional parent comment id and configurable header/submit labels) while keeping all new user-facing text in English."
        },
        {
          "path": "frontend/src/components/blog/BlogCommentsThread.tsx",
          "operation": "create",
          "description": "Create a public comments thread renderer that groups comments by parentId and renders nested replies under their parent, including a per-comment \"Reply\" action that opens a reply form. Ensure all new user-facing text is English."
        },
        {
          "path": "frontend/src/pages/BlogDetailPage.tsx",
          "operation": "modify",
          "description": "Fetch and render the comment list section below the interactions/form area using existing blog comments query hooks; wire reply submissions to call the existing add comment mutation with parentId, and ensure the list updates via React Query invalidation without a full page refresh. Ensure any new UI text is English."
        }
      ]
    },
    {
      "id": "REQ-118",
      "summary": "Extend the existing admin Blog editor dialog to moderate threaded comments by allowing admins to edit and delete individual comments/replies (and keep new admin UI text in English).",
      "acceptanceCriteria": [
        "Backend supports storing a comment as either a top-level comment or a reply tied to a parent comment (threaded structure) in stable, upgrade-safe persistence.",
        "Public API supports: (1) fetching approved comments (including replies) for a blogPostId, and (2) creating a top-level comment or a reply for a blogPostId.",
        "Admin API supports: editing an individual comment (at minimum the content) and deleting an individual comment (whether top-level or reply).",
        "The existing admin Blog editor dialog (/admin blog management area) is updated so admins can edit and delete individual comments (not only delete-all), and the admin UI remains in English for any new text added."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/hooks/useAdminCmsQueries.ts",
          "operation": "modify",
          "description": "Add an admin mutation hook for updating an individual blog comment's content (wrapping the existing backend capability) and invalidate the relevant admin/public comment queries on success."
        },
        {
          "path": "frontend/src/admin/components/BlogFormDialog.tsx",
          "operation": "modify",
          "description": "Update the existing Comments moderation section to (1) render comments in a threaded/nested view using parentId, and (2) provide per-comment edit and delete controls for both top-level comments and replies. Keep any newly introduced admin UI text in English."
        }
      ]
    },
    {
      "id": "REQ-119",
      "summary": "Increment blog post views when a visitor opens the public Blog Detail page (session-scoped per visitor per article) and ensure the incremented views value is used in admin views counters.",
      "acceptanceCriteria": [
        "When a visitor opens a Blog Detail page, the system increments that blog post’s views count via a backend method, and the blog post’s views value returned by the public blog post query reflects the increment.",
        "The view increment occurs at most once per visitor per article within a reasonable single browsing session (to avoid multiple increments from re-renders/navigation loops).",
        "The /admin Blog management UI shows the same views value for the article as stored in the backend (i.e., the counter used by admin is actually updated by public visits).",
        "Any new user-facing text introduced by this change is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a public hook that triggers the backend capability to increment-and-return the blog post views count, and update/invalidate the relevant blog post queries so the UI reflects the updated views value."
        },
        {
          "path": "frontend/src/pages/BlogDetailPage.tsx",
          "operation": "modify",
          "description": "On Blog Detail page load, call the views increment hook at most once per browsing session per blogPostId (e.g., sessionStorage key scoped by blogPostId) to avoid multiple increments from re-renders, and ensure the displayed views count reflects the updated value. Ensure any new user-facing text is English."
        }
      ]
    }
  ]
}