{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Home vertical main-banner slider, CTA/About layout fixes, and Admin Media banner + library reliability",
  "requirements": [
    {
      "id": "REQ-141",
      "summary": "Add a 2-image Home main banner that auto-rotates with a vertical slide-up animation while preserving the current hero footprint.",
      "acceptanceCriteria": [
        "The Home page main banner displays 2 images and automatically alternates between them using a vertical slide-up animation.",
        "The banner remains at the top of the Home page (below the navbar) and keeps the same layout footprint as the current single banner.",
        "If only 1 image is configured, the banner renders that single image with no sliding animation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/HomeMainBannerSlider.tsx",
          "operation": "create",
          "description": "Create a lightweight, no-third-party vertical (slide-up) image slider component that accepts an ordered list of image URLs and auto-rotates; ensure it renders a single static image when only one URL is provided."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace the single main banner <img> with the new HomeMainBannerSlider and keep the banner section placement and dimensions consistent with the existing layout."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS (or Tailwind-compatible keyframes/classes) to support the vertical slide-up animation and an overflow-hidden banner viewport without changing the banner footprint."
        }
      ]
    },
    {
      "id": "REQ-142",
      "summary": "Extend /admin/media to upload and manage an ordered set of Home main banner slider images (min 2) alongside existing CTA banner configuration.",
      "acceptanceCriteria": [
        "/admin/media provides a clear section to manage 'Home Main Banner' images and allows uploading media directly into that banner set.",
        "An admin can set at least two images for the Home main banner without leaving /admin/media.",
        "All newly introduced admin UI text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/pages/MediaManagerPage.tsx",
          "operation": "modify",
          "description": "Update the banner configuration card to include a dedicated 'Home Main Banner (Slider)' manager with English UI text, supporting adding multiple images, ordering, and removing; keep existing CTA banner selection intact."
        },
        {
          "path": "frontend/src/admin/components/media/HomeMainBannerManager.tsx",
          "operation": "create",
          "description": "Create an admin-only manager component for the Home main banner image set that integrates selection (via existing MediaPickerDialog) and direct upload into a dedicated folder/set. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/components/media/MediaUploadButton.tsx",
          "operation": "modify",
          "description": "Extend MediaUploadButton to better support banner-specific uploads (e.g., pass folder and an onUploadComplete callback from the new HomeMainBannerManager) so admins can upload directly into the Home main banner set from /admin/media. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-144",
      "summary": "Make useGetPublicSiteBanners return real backend banner configuration (main banner URLs + CTA URL) and wire the returned values into Home rendering with fallbacks.",
      "acceptanceCriteria": [
        "The public hook currently named useGetPublicSiteBanners returns real backend values for main banner image URLs and CTA banner URL when configured.",
        "HomePage uses the returned values to render the configured main banner slider and CTA banner.",
        "If the backend returns no configured URLs, the existing fallback static assets continue to be used."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useGetPublicSiteBanners to fetch the ordered main banner image URL list using the backend capability already available (getMainBannerImageUrls), and to retrieve a configured CTA banner URL when available; preserve fallback behavior when no configuration exists."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Wire HomePage to use useGetPublicSiteBanners results for (a) main banner slider URL list and (b) CTA banner URL, falling back to existing static generated assets when values are missing."
        }
      ]
    },
    {
      "id": "REQ-145",
      "summary": "Fix Home CTA banner section spacing and sizing: flush to adjacent sections, full-bleed on mobile, controlled height, and dark background.",
      "acceptanceCriteria": [
        "The CTA banner has no extra vertical spacing above/below it and visually touches the sections before/after it.",
        "On mobile, the CTA banner is full-bleed (flush to the viewport edges) with no container side padding.",
        "The CTA banner does not grow excessively tall; it renders with a controlled height appropriate for a CTA strip/banner (distinct from the main hero banner).",
        "The CTA banner section background is dark gray/black."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Adjust Featured Vehicles bottom spacing and About section top spacing so the CTA section touches adjacent sections; render CTA inside a dark background wrapper with controlled height and object-cover behavior; ensure mobile is full-bleed with no side padding."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust any shared styles needed for a consistent full-bleed CTA banner wrapper and controlled banner heights without impacting other sections."
        }
      ]
    },
    {
      "id": "REQ-146",
      "summary": "Restore the Home 'About Us / Tentang Kami' section styling and background color treatment to the earlier design.",
      "acceptanceCriteria": [
        "The Home page About section styling (layout + color treatment) matches the earlier design used before the recent changes.",
        "The section uses the intended brand-consistent About-section color styling (no unintended gray/white card-only presentation if it was previously a colored section)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the About section markup and Tailwind classes to restore the previous design and background color treatment (remove the unintended card-only/neutral presentation if applicable) while keeping the section content and placement."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed, restore or reintroduce the prior About section color tokens/classes (using existing global styling entry points) to match the earlier brand-consistent design."
        }
      ]
    },
    {
      "id": "REQ-147",
      "summary": "Make Admin Media Library reliably render uploaded images after upload and after refresh, with stable loading/error handling in English.",
      "acceptanceCriteria": [
        "Uploading an image in /admin/media succeeds and the image appears in the Media Library grid without requiring a hard reload.",
        "After a browser refresh, previously uploaded media still loads and displays in the Media Library.",
        "The Media Library does not show a persistent error state when valid admin session credentials are present.",
        "All user-facing admin error/empty/loading messages involved in this fix remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/hooks/useAdminCmsQueries.ts",
          "operation": "modify",
          "description": "Harden media query behavior so a transient session-token resolution issue does not permanently stick the Media Library in an error state; ensure successful uploads and deletes reliably trigger media list refresh (React Query invalidation/refetch) while keeping admin messages in English."
        },
        {
          "path": "frontend/src/admin/components/media/MediaManagerPanel.tsx",
          "operation": "modify",
          "description": "Improve Media Library rendering robustness: tolerate unexpected media types, handle broken image URLs gracefully, and ensure the grid updates immediately after uploads via query refresh; keep all admin-facing empty/loading/error strings in English."
        },
        {
          "path": "frontend/src/admin/components/media/MediaUploadButton.tsx",
          "operation": "modify",
          "description": "Improve upload reliability by integrating the blob-storage component's ExternalBlob-based workflow for generating a stable direct URL (instead of relying on large data URLs where applicable), then create the MediaAsset using that URL and refresh the media list. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/components/media/MediaPickerDialog.tsx",
          "operation": "modify",
          "description": "Ensure the picker dialog reflects newly uploaded assets without requiring a hard reload (e.g., by triggering/refetching the shared media query) and maintains English loading/empty/error messaging."
        }
      ]
    }
  ]
}