{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin CMS regression fixes (frontend): media visibility + save/publish resilience",
  "requirements": [
    {
      "id": "REQ-85",
      "summary": "Make Media Manager and editor Media Picker reliably load/search/select existing media assets using the existing caffeineAdminSession token, including after re-login.",
      "acceptanceCriteria": [
        "If media assets exist in canister storage, they appear in `/admin/media` and in MediaPicker dialogs used by editors (Vehicle/Promotion/Testimonial/Blog).",
        "If no media assets exist, the existing empty-state UI remains visible (e.g., “No media yet.”) and no unhandled exceptions occur.",
        "Media list loading does not fail due to authorization when the user is logged in and a valid `caffeineAdminSession.token` exists."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/hooks/useAdminCmsQueries.ts",
          "operation": "modify",
          "description": "Update the media-asset query to key off the current `caffeineAdminSession` token (e.g., include token in the React Query `queryKey` and `enabled`), so the media list refetches correctly after re-login without changing the storage key. Also normalize unauthorized handling: if `getMediaAssets(token)` returns `null`, throw a consistent English error that existing UI can treat as session-expired."
        },
        {
          "path": "frontend/src/admin/hooks/useAdminSession.ts",
          "operation": "modify",
          "description": "Harden admin session validation to treat a `null` return from `getVisitorStats(token)` as an invalid/expired session (clear `caffeineAdminSession` and set session to null). This ensures media and other admin screens recover cleanly after re-login."
        },
        {
          "path": "frontend/src/admin/components/media/MediaManagerPanel.tsx",
          "operation": "modify",
          "description": "Align auth-error detection with the updated, normalized errors from admin CMS hooks so the existing Session Expired UI reliably appears for invalid sessions and the media grid renders when authorized."
        },
        {
          "path": "frontend/src/admin/components/media/MediaPickerDialog.tsx",
          "operation": "modify",
          "description": "Align auth-error detection with the updated, normalized errors from admin CMS hooks so editors can load/search/select media when authorized and see the existing Session Expired messaging when not."
        },
        {
          "path": "frontend/src/admin/pages/MediaManagerPage.tsx",
          "operation": "modify",
          "description": "Ensure the page-level session-expired banner is driven by the normalized unauthorized error message from the media query (and continues to work after token refresh via re-login)."
        }
      ]
    },
    {
      "id": "REQ-86",
      "summary": "Restore Admin CMS save/publish operations across Vehicles/Promotions/Testimonials/Blog by ensuring admin mutations properly fail on unauthorized/falsey results and trigger expected React Query refresh behavior.",
      "acceptanceCriteria": [
        "From each admin management page (Vehicles, Promotions, Testimonials, Blog), creating a new item and saving succeeds without errors and the item appears in the table.",
        "Editing an existing item and saving persists changes and the table updates after save (via existing React Query invalidation).",
        "Toggling Published/Draft and saving persists and the status badge in the CRUD table updates accordingly.",
        "If the session is missing/expired, the UI shows the existing English session-required/session-expired messaging instead of silently failing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/hooks/useAdminCmsQueries.ts",
          "operation": "modify",
          "description": "For admin CMS create/update/delete mutations (Vehicles/Promotions/Testimonials/Blog, plus any related admin mutations already in this file), enforce result checking: if the backend returns `false` (or a `null` where applicable), throw a consistent English error (e.g., unauthorized/session expired vs generic failure) so the UI does not treat failures as success. Also include the current `caffeineAdminSession` token in relevant query keys (where those queries exist) so listings refetch correctly after re-login and invalidation targets the active session cache."
        },
        {
          "path": "frontend/src/admin/pages/VehiclesAdminPage.tsx",
          "operation": "modify",
          "description": "Adjust save error handling to surface session-expired/unauthorized failures from the updated admin CMS mutation hooks (keep English messaging) and avoid closing the editor dialog on failed saves, so users can re-login and retry successfully."
        },
        {
          "path": "frontend/src/admin/pages/PromotionsAdminPage.tsx",
          "operation": "modify",
          "description": "Adjust save error handling to surface session-expired/unauthorized failures from the updated admin CMS mutation hooks (keep English messaging) and avoid closing the editor dialog on failed saves."
        },
        {
          "path": "frontend/src/admin/pages/TestimonialsAdminPage.tsx",
          "operation": "modify",
          "description": "Adjust save error handling to surface session-expired/unauthorized failures from the updated admin CMS mutation hooks (keep English messaging) and avoid closing the editor dialog on failed saves."
        },
        {
          "path": "frontend/src/admin/pages/BlogAdminPage.tsx",
          "operation": "modify",
          "description": "Adjust save error handling to surface session-expired/unauthorized failures from the updated admin CMS mutation hooks (keep English messaging) and avoid closing the editor dialog on failed saves."
        }
      ]
    }
  ]
}