{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Blog interactions UI + comment flow wired to canister interactions with admin comment moderation (frontend-only)",
  "requirements": [
    {
      "id": "REQ-107",
      "summary": "Add an additive 3-icon interaction row (Love count, Share, Comment toggle) directly under the blog article content on Blog Detail without changing existing layout structure.",
      "acceptanceCriteria": [
        "On `/blog/$id`, a 3-icon interaction row appears directly under the article (left-aligned): Love (with count), Share, Comment.",
        "The Love count is rendered in the format \"❤️ (N)\" where N matches persisted data for that blog post.",
        "Clicking the Comment icon toggles a comment form area directly below the icons; clicking again hides it.",
        "No other public page structure or routing changes occur as part of this requirement."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BlogDetailPage.tsx",
          "operation": "modify",
          "description": "Insert a new left-aligned, horizontal interaction block directly below the existing article content area (additive only): Love (render as \"❤️ (N)\" from canister-backed summary), Share (triggers share tracking), Comment (toggles the comment form visibility). Use minimalist icon buttons (e.g., lucide-react icons consistent with other pages) and shadcn-ui Button styling where appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/blog/BlogInteractionsBar.tsx",
          "operation": "create",
          "description": "Create a reusable public blog interactions bar component rendering the three minimalist actions (Love with \"❤️ (N)\", Share, Comment toggle) in a left-aligned horizontal row, designed to be embedded under the blog article content without re-structuring the page. Use shadcn-ui Button (and optionally Tooltip/Separator if available) and lucide-react icons for a clean aesthetic; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-108",
      "summary": "Implement the public Name/Email/Comment form UI under the interaction icons and persist comments via canister, clearing and refreshing interaction state after submit.",
      "acceptanceCriteria": [
        "The comment form includes inputs for Name, Email, and Comment, and a submit button.",
        "Submitting creates a persisted comment for the current blog post and resets the form on success.",
        "After successful submit, the UI refreshes interaction data (at least comment count) without a full page reload.",
        "All newly introduced user-facing strings for this feature are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/blog/BlogCommentForm.tsx",
          "operation": "create",
          "description": "Create a public comment form component with exactly these fields: Name, Email, Comment, plus a submit button. Provide English-only placeholders/labels, client-side validation messages, and a submitting state. Use shadcn-ui Input/Textarea/Button for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/BlogDetailPage.tsx",
          "operation": "modify",
          "description": "Render the new comment form component directly below the interaction bar when the Comment icon is toggled open. Wire submit to the comment mutation, clear the form on success, and refresh interaction summary state via React Query invalidation (no full page reload). Ensure any new public strings introduced here are in English."
        }
      ]
    },
    {
      "id": "REQ-111",
      "summary": "Add React Query public hooks for blog interactions in useQueries.ts and integrate them into BlogDetailPage end-to-end while preserving existing blog loading and SEO behavior.",
      "acceptanceCriteria": [
        "`useQueries.ts` includes new hooks for article interactions and these hooks call the new backend methods.",
        "`BlogDetailPage.tsx` continues to load and render the blog content exactly as before, plus the new interaction UI.",
        "Like/share/comment actions update counts via React Query invalidation/refetch (no hard refresh required).",
        "No changes are introduced to immutable frontend paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extend the public React Query hook layer with blog interaction hooks that call existing backend capabilities from the actor: getBlogInteractionSummary, incrementBlogLike, incrementBlogShare (platform string), addBlogComment, and (if needed by UI) getBlogComments. Ensure mutations invalidate/refetch the correct interaction queries (and comments query where applicable) to update counts without a hard refresh."
        },
        {
          "path": "frontend/src/pages/BlogDetailPage.tsx",
          "operation": "modify",
          "description": "Integrate the new interaction hooks into BlogDetailPage while keeping existing blog rendering and metadata updates intact (document title + meta description behavior unchanged). Ensure the interaction bar uses the summary query and mutations, and that share/like/comment update counts via React Query refetch/invalidation."
        }
      ]
    },
    {
      "id": "REQ-112",
      "summary": "Extend the existing /admin blog management UI to show read-only interaction counts for a selected blog post and provide an admin-only comment list with delete moderation.",
      "acceptanceCriteria": [
        "In the /admin blog management flow, an admin can view interaction counts for a blog post (likes/shares/comments).",
        "Admins can view a list of comments for a blog post and delete individual comments.",
        "Comment deletion persists (deleted comments no longer appear after refresh).",
        "No existing admin blog CRUD (create/edit/publish/delete posts) is broken by these additions.",
        "All newly introduced admin UI text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/hooks/useAdminCmsQueries.ts",
          "operation": "modify",
          "description": "Add admin-only React Query hooks for blog interaction moderation within the existing admin hooks module: fetch blog interaction summary for a blog post, fetch comments for a blog post, and delete a comment (requires existing admin session token). Ensure query keys include the blogPostId and that delete invalidates the related comments/summary queries."
        },
        {
          "path": "frontend/src/admin/components/BlogFormDialog.tsx",
          "operation": "modify",
          "description": "Augment the existing blog editor dialog (without changing routes/layout) to show a read-only 'Interaction' section for existing posts (likes/shares/comments counts) and an admin-only 'Comments' section listing comments for the current post with a per-comment delete action. Use existing shadcn-ui components (buttons, dialogs) to keep admin styling consistent; verify the component's usage instructions before implementing. Ensure all new admin text is in English."
        },
        {
          "path": "frontend/src/admin/pages/BlogAdminPage.tsx",
          "operation": "modify",
          "description": "Wire the enhanced BlogFormDialog moderation UI into the admin blog management flow by ensuring the selected post context is passed as-is and that the dialog can be used for viewing interaction counts and moderating comments without impacting existing CRUD actions or the overall admin layout. Ensure any new admin-facing strings introduced here are in English."
        }
      ]
    }
  ]
}